venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This enumeration is processor specific and is defined in the processor-
    specific header files (see processor.h).
*/

typedef enum {

    ETH_HASH_FILTER              /*DOM-IGNORE-BEGIN*/ = 1<<15  /*DOM-IGNORE-END*/ , //Enable: Hash Table Filtering.
    ETH_MAGIC_PACKET_FILTER      /*DOM-IGNORE-BEGIN*/ = 1<<14  /*DOM-IGNORE-END*/ , //Enable: Magic Packet Filtering.
    ETH_PATTERN_MATCH_INVERSION  /*DOM-IGNORE-BEGIN*/ = 1<<12  /*DOM-IGNORE-END*/ , //Enable: Pattern Match Checksum must not match to be accepted.
    ETH_CRC_ERROR_FILTER         /*DOM-IGNORE-BEGIN*/ = 1<<7   /*DOM-IGNORE-END*/ , //Enable: Received packet CRC must be invalid to be accepted.
    ETH_CRC_OK_FILTER            /*DOM-IGNORE-BEGIN*/ = 1<<6   /*DOM-IGNORE-END*/ , //Enable: Received packet CRC must be valid to be accepted.
    ETH_RUNT_ERROR_FILTER        /*DOM-IGNORE-BEGIN*/ = 1<<5   /*DOM-IGNORE-END*/ , //Enable: Received packet must be runt packet to be accepted.
    ETH_RUNT_ENABLE_FILTER       /*DOM-IGNORE-BEGIN*/ = 1<<4   /*DOM-IGNORE-END*/ , //Enable: Received packet must not be a runt packet to be accepted.
    ETH_UNICAST_FILTER           /*DOM-IGNORE-BEGIN*/ = 1<<3   /*DOM-IGNORE-END*/ , //Enable: Unicast Packets whose destination address matches the station address are accepted.
    ETH_NOT_ME_UNICAST_FILTER    /*DOM-IGNORE-BEGIN*/ = 1<<2   /*DOM-IGNORE-END*/ , //Enable: Unicast Packets whose destination address do NOT match the station address are accepted.
    ETH_MULTICAST_FILTER         /*DOM-IGNORE-BEGIN*/ = 1<<1   /*DOM-IGNORE-END*/ , //Enable: Multicast Address Packets are accepted.
    ETH_BROADCAST_FILTER         /*DOM-IGNORE-BEGIN*/ = 1<<0   /*DOM-IGNORE-END*/ , //Enable: Broadcast Address Packets are accepted.
    ETH_ENABLE_ALL_FILTER        /*DOM-IGNORE-BEGIN*/ = 0xD0FF /*DOM-IGNORE-END*/   //Enable: All of the above packets are accepted.

} ETH_RECEIVE_FILTER;


//*****************************************************************************
/* AutoDetectPad Selection

  Summary:
    Lists the possible automatic padding configurations.

  Description:
    This enumeration lists the possible automatic padding configurations.

  Remarks:
    This enumeration is processor specific and is defined in the processor-
    specific header files (see processor.h).
*/
typedef enum {

    ETH_AUTOPAD_DISABLED_CHECK_CRC   /*DOM-IGNORE-BEGIN*/ = 0x00 /*DOM-IGNORE-END*/ ,
    ETH_AUTOPAD_TO_60BYTES_ADD_CRC   /*DOM-IGNORE-BEGIN*/ = 0x01 /*DOM-IGNORE-END*/ ,
    ETH_AUTOPAD_TO_64BYTES_ADD_CRC   /*DOM-IGNORE-BEGIN*/ = 0x02 /*DOM-IGNORE-END*/ ,
    ETH_AUTOPAD_BY_PKT_TYPE_ADD_CRC  /*DOM-IGNORE-BEGIN*/ = 0x05 /*DOM-IGNORE-END*/

} ETH_AUTOPAD_OPTION;


//*****************************************************************************
/* ETH Module Interrupt Mask

  Summary:
    Lists the possible values of ETH_INTERRUPT_SOURCES.

  Description:
    This enumeration lists the possible values of ETH_INTERRUPT_SOURCES.

  Remarks:
    See also PLIB_ETH_EVENTS in plib_eth_lib.h.
*/

typedef enum {

    ETH_TRANSMIT_BVCI_BUS_ERROR_INTERRUPT       /*DOM-IGNORE-BEGIN*/ = 1<<14 /*DOM-IGNORE-END*/ ,
    ETH_RECEIVE_BVCI_BUS_ERROR_INTERRUPT        /*DOM-IGNORE-BEGIN*/ = 1<<13 /*DOM-IGNORE-END*/ ,
    ETH_EMPTY_WATERMARK_INTERRUPT               /*DOM-IGNORE-BEGIN*/ = 1<<9  /*DOM-IGNORE-END*/ ,
    ETH_FULL_WATERMARK_INTERRUPT                /*DOM-IGNORE-BEGIN*/ = 1<<8  /*DOM-IGNORE-END*/ ,
    ETH_RECEIVE_DONE_INTERRUPT                  /*DOM-IGNORE-BEGIN*/ = 1<<7  /*DOM-IGNORE-END*/ ,
    ETH_PACKET_PENDING_INTERRUPT                /*DOM-IGNORE-BEGIN*/ = 1<<6  /*DOM-IGNORE-END*/ ,
    ETH_RECEIVE_ACTIVITY_INTERRUPT              /*DOM-IGNORE-BEGIN*/ = 1<<5  /*DOM-IGNORE-END*/ ,
    ETH_TRANSMIT_DONE_INTERRUPT                 /*DOM-IGNORE-BEGIN*/ = 1<<3  /*DOM-IGNORE-END*/ ,
    ETH_TRANSMIT_ABORT_INTERRUPT                /*DOM-IGNORE-BEGIN*/ = 1<<2  /*DOM-IGNORE-END*/ ,
    ETH_RECEIVE_BUFFER_NOT_AVAILABLE_INTERRUPT  /*DOM-IGNORE-BEGIN*/ = 1<<1  /*DOM-IGNORE-END*/ ,
    ETH_RECEIVE_FIFO_OVERFLOW_ERROR_INTERRUPT   /*DOM-IGNORE-BEGIN*/ = 1<<0  /*DOM-IGNORE-END*/ ,
    ETH_ALL_INTERRUPT_SOURCES                   /*DOM-IGNORE-BEGIN*/ = 0x63EF/*DOM-IGNORE-END*/

} ETH_INTERRUPT_SOURCES;


// *****************************************************************************
/* Ethernet Receive Filter Flags

  Summary:
    Defines the receive filter flags

  Description:
    This enumeration defines the receive filter flags.

  Remarks:
    Multiple values can be OR-ed together.

    The values in this enumeration are displayed in the order of priority
    that the receive filter state machine works, with the highest priority first.
    Once a filter accepts or rejects a packet, further filters are not tried.
    If a packet isn't rejected/accepted after all filters are tried, it will be rejected by
    default!
*/

typedef enum
{
#if defined(_ETHRXFC_CRCERREN_MASK)
    // Frames with wrong CRC are accepted
    ETH_FILT_CRC_ERR_ACCEPT
        /*DOM-IGNORE-BEGIN*/ = _ETHRXFC_CRCERREN_MASK /*DOM-IGNORE-END*/,

    // Runt frames accepted
    ETH_FILT_RUNT_ACCEPT
        /*DOM-IGNORE-BEGIN*/ = _ETHRXFC_RUNTERREN_MASK /*DOM-IGNORE-END*/,

    // Frames with wrong CRC are rejected
    ETH_FILT_CRC_ERR_REJECT
        /*DOM-IGNORE-BEGIN*/ = _ETHRXFC_CRCOKEN_MASK /*DOM-IGNORE-END*/,

    // Runt frames rejected
    ETH_FILT_RUNT_REJECT
        /*DOM-IGNORE-BEGIN*/ = _ETHRXFC_RUNTEN_MASK /*DOM-IGNORE-END*/,

    // Me unicast accepted
    ETH_FILT_ME_UCAST_ACCEPT
        /*DOM-IGNORE-BEGIN*/ = _ETHRXFC_UCEN_MASK /*DOM-IGNORE-END*/,

    // Not me unicast accepted
    ETH_FILT_NOTME_UCAST_ACCEPT
        /*DOM-IGNORE-BEGIN*/ = _ETHRXFC_NOTMEEN_MASK /*DOM-IGNORE-END*/,

    // Multicast accepted
    ETH_FILT_MCAST_ACCEPT
        /*DOM-IGNORE-BEGIN*/ = _ETHRXFC_MCEN_MASK /*DOM-IGNORE-END*/,

    // Broadcast accepted
    ETH_FILT_BCAST_ACCEPT
        /*DOM-IGNORE-BEGIN*/ = _ETHRXFC_BCEN_MASK /*DOM-IGNORE-END*/,

    // Hash table matches destination address accepted
    ETH_FILT_HTBL_ACCEPT
        /*DOM-IGNORE-BEGIN*/ = _ETHRXFC_HTEN_MASK /*DOM-IGNORE-END*/,

    // Magic packet accepted
    ETH_FILT_MAGICP_ACCEPT
        /*DOM-IGNORE-BEGIN*/ = _ETHRXFC_MPEN_MASK /*DOM-IGNORE-END*/,


    // All Filters
    ETH_FILT_ALL_FILTERS
     /*DOM-IGNORE-BEGIN*/    = ETH_FILT_CRC_ERR_ACCEPT  | ETH_FILT_RUNT_ACCEPT        |
                               ETH_FILT_CRC_ERR_REJECT  | ETH_FILT_RUNT_REJECT        |
                               ETH_FILT_ME_UCAST_ACCEPT | ETH_FILT_NOTME_UCAST_ACCEPT |
                               ETH_FILT_MCAST_ACCEPT    | ETH_FILT_BCAST_ACCEPT       |
                               ETH_FILT_HTBL_ACCEPT     | ETH_FILT_MAGICP_ACCEPT  /*DOM-IGNORE-END*/
#else
    /*DOM-IGNORE-BEGIN*/        
    // Reserved for processors that do not have the internal Ethernet module
    ETH_RX_FILTERS_RESERVED,
    /*DOM-IGNORE-END*/
#endif
} ETH_RX_FILTERS;


// *****************************************************************************
/* Ethernet Pattern Match Modes

  Summary:
    Defines pattern match modes

  Description:
    This enumeration defines the Ethernet pattern match modes.

