venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    These are mutually exclusive modes, not flags.  However,
    ETH_FILT_PMATCH_INVERT act as a flag and can be applied to any value.
*/

typedef enum
{
    // Simple Pattern Match accepted
    ETH_FILT_PMATCH_ACCEPT /*DOM-IGNORE-BEGIN*/ = 1/*DOM-IGNORE-END*/,

    // Pattern Match AND destination==me
    ETH_FILT_PMATCH_ME_UCAST_ACCEPT,

    // Pattern Match AND destination!=me
    ETH_FILT_PMATCH_NOTME_UCAST_ACCEPT,

    // Pattern Match AND destination!=unicast
    ETH_FILT_PMATCH_MCAST_ACCEPT,

    // Pattern Match AND destination==unicast
    ETH_FILT_PMATCH_NOT_MCAST_ACCEPT,

    // Pattern Match AND destination==broadcast
    ETH_FILT_PMATCH_BCAST_ACCEPT,

    // Pattern Match AND destination!=broadcast
    ETH_FILT_PMATCH_NOT_BCAST_ACCEPT,

    // Pattern Match AND hash table filter match (regardless of the
    // ETH_FILT_HTBL_ACCEPT setting)
    ETH_FILT_PMATCH_HTBL_ACCEPT,

    // Pattern Match AND packet ==magic packet
    ETH_FILT_PMATCH_MAGICP_ACCEPT,

    // If set, the pattern must NOT match for a successful Pattern Match to occur!
    ETH_FILT_PMATCH_INVERT /*DOM-IGNORE-BEGIN*/ = 0x80000000 /*DOM-IGNORE-END*/

} ETH_PMATCH_MODE;


// *****************************************************************************
/* Ethernet Event Flags

  Summary:
    Ethernet event flags

  Description:
    This enumeration defines flags for the possible Ethernet events that can
    cause interrupts.
*/

typedef enum
{
#if defined(_ETHRXFC_CRCERREN_MASK)
    // RX FIFO overflow
    ETH_EV_RXOVFLOW
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_RXOVFLW_MASK /*DOM-IGNORE-END*/,

    // RX buffer not available (descriptor overrun)
    ETH_EV_RXBUFNA
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_RXBUFNA_MASK /*DOM-IGNORE-END*/,

    // TX abort condition
    ETH_EV_TXABORT
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_TXABORT_MASK /*DOM-IGNORE-END*/,

    // TX done
    ETH_EV_TXDONE
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_TXDONE_MASK  /*DOM-IGNORE-END*/,

    // RX activity
    ETH_EV_RXACT
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_RXACT_MASK   /*DOM-IGNORE-END*/,

    // RX packet pending
    ETH_EV_PKTPEND
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_PKTPEND_MASK /*DOM-IGNORE-END*/,

    // RX packet successfully received
    ETH_EV_RXDONE
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_RXDONE_MASK  /*DOM-IGNORE-END*/,

    // Full watermark reached
    ETH_EV_FWMARK
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_FWMARK_MASK  /*DOM-IGNORE-END*/,

    // Empty watermark reached
    ETH_EV_EWMARK
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_EWMARK_MASK  /*DOM-IGNORE-END*/,

    // RX bus error
    ETH_EV_RXBUSERR
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_RXBUSE_MASK  /*DOM-IGNORE-END*/,

    // TX bus error
    ETH_EV_TXBUSERR
        /*DOM-IGNORE-BEGIN*/ = _ETHIRQ_TXBUSE_MASK  /*DOM-IGNORE-END*/,

    // All events
    ETH_EV_ALL
    /*DOM-IGNORE-BEGIN*/= (ETH_EV_RXOVFLOW | ETH_EV_RXBUFNA | ETH_EV_TXABORT |
                           ETH_EV_TXDONE   | ETH_EV_RXACT   | ETH_EV_PKTPEND |
                           ETH_EV_RXDONE   | ETH_EV_FWMARK  | ETH_EV_EWMARK  |
                           ETH_EV_RXBUSERR | ETH_EV_TXBUSERR ) /*DOM-IGNORE-END*/
#else
    /*DOM-IGNORE-BEGIN*/        
    // Reserved for processors that do not have the internal Ethernet module
    PLIB_ETH_EVENTS_RESERVED,
    /*DOM-IGNORE-END*/
#endif
} PLIB_ETH_EVENTS;


// *****************************************************************************
// *****************************************************************************
// Section: Includes
// *****************************************************************************
// *****************************************************************************
/* See Bottom of file for implementation header include files.
*/
// DOM-IGNORE-BEGIN
#include "peripheral/eth/processor/eth_processor.h"
// DOM-IGNORE-END


// *****************************************************************************
// *****************************************************************************
// Section: Peripheral Library Interface Routines
// *****************************************************************************
// *****************************************************************************

//******************************************************************************
/* Function:
    void PLIB_ETH_PauseTimerSet(ETH_MODULE_ID index, uint16_t PauseTimerValue)

  Summary:
    Sets the Pause Timer value used for flow control.

  Description:
    This function sets the Pause Timer value used for flow control.

  Precondition:
    Write to the Pause Timer register before enabling the receiver. Call this 
	function before calling PLIB_ETH_ReceiveEnable.

  Parameters:
    index - Identifier for the device instance
    PauseTimerValue - used for Flow Control

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PauseTimerSet(MY_ETH_INSTANCE, PauseTimerValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the 
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PauseTimerSet(ETH_MODULE_ID index, uint16_t PauseTimerValue);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_PauseTimerGet(ETH_MODULE_ID index)

  Summary:
    Gets the Pause Timer value used for flow control.

  Description:
    This function gets the Pause Timer value used for flow control.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - PauseTimerValue - Pause Timer Value

  Example:
    <code>
    PauseTimerValue = PLIB_ETH_PauseTimerGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_PauseTimerGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_Enable(ETH_MODULE_ID index)

  Summary:
    Enables the Ethernet module.

  Description:
    This function enables the Ethernet module.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_Enable(MY_ETH_INSTANCE);
    </code>

