venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_Enable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_Disable(ETH_MODULE_ID index)

  Summary:
    Disables the Ethernet module.

  Description:
    This function disables the Ethernet module.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_Disable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_Disable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_IsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module enable status.

  Description:
    This function returns the Ethernet module enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet module is enabled
    - false - Ethernet module is disabled

  Example:
    <code>
    stat = PLIB_ETH_IsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_IsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_StopInIdleEnable(ETH_MODULE_ID index)

  Summary:
    Ethernet module operation will stop when the device enters Idle mode.

  Description:
    This function directs the Ethernet module to stop operation when the device 
    enters Idle mode.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_StopInIdleEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_StopInIdleEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_StopInIdleDisable(ETH_MODULE_ID index)

  Summary:
    Ethernet module operation will continue when the device enters Idle mode.

  Description:
    This function directs the Ethernet module to continue operation when the
    device enters Idle mode.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_StopInIdleDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_StopInIdleDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_StopInIdleIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module Stop in Idle mode enable status.

  Description:
    This function returns the Ethernet module Stop in Idle mode enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet module transfers stop during Idle mode
    - false - Ethernet module transfers continue to run during Idle mode

  Example:
    <code>
    stat = PLIB_ETH_StopInIdleIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_StopInIdleIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxRTSEnable(ETH_MODULE_ID index)

  Summary:
    Enables the Ethernet transmit request to send.

  Description:
    This function enables the Ethernet request to send. Transmit logic is activated
    and any packets defined in the Ethernet descriptor table are transmitted.

  Precondition:
    The TX descriptor list and TX DMA must be initialized using 
    PLIB_ETH_TransmitPacketDescStartAddrSet.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxRTSEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This status is cleared by hardware when the transmission is complete.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxRTSEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxRTSDisable(ETH_MODULE_ID index)

  Summary:
    Aborts an Ethernet module transmission.

  Description:
    This function aborts an Ethernet module transmission and disables the 
    transmitter after the current packet has completed.

  Precondition
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxRTSDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    When disabled by software, transmission stops after the current packet
    has been completed.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxRTSDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_TxRTSIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module transmit request to send status.

  Description:
    This function returns the Ethernet module transmit request to send status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet module transmit is active
    - false - Ethernet module transmission has stopped or has completed

  Example:
    <code>
    stat = PLIB_ETH_TransmitRTSIsEnabled(MY_ETH_INSTANCE);
    </code>

