venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_TxRTSIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxEnable(ETH_MODULE_ID index)

  Summary:
    Enables the Ethernet receive logic.

  Description:
    This function enables the Ethernet receive logic. Packets are received and
    stored in the receive buffer as controlled by the filter configuration.

  Precondition:
    All receive registers must be configured before calling this function.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxDisable(ETH_MODULE_ID index)

  Summary:
    Disables the Ethernet module receive logic.

  Description:
    This function disables the Ethernet receive logic.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Disabling Ethernet receive is not recommended for making changes to any
    receive-related registers. After the receiver has been enabled,
    the Ethernet module must be reinitialized to implement changes.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_RxIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module receive enable status.

  Description:
    This function returns the Ethernet module receive enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet module receive is enabled
    - false - Ethernet module receive is disabled

  Example:
    <code>
    stat = PLIB_ETH_ReceiveIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_RxIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_AutoFlowControlEnable(ETH_MODULE_ID index)

  Summary:
    Enables the Ethernet Automatic Flow Control logic.

  Description:
    This function enables Ethernet Automatic Flow Control logic.
	This function performs atomic register access.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_AutoFlowControlEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    The full and empty watermarks are used to automatically enable and disable
    flow control, respectively. When the number of received buffers rises to
    the full watermark, flow control is automatically enabled.
    When the receive buffer count falls to the empty watermark, flow control is
    automatically disabled.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_AutoFlowControlEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_AutoFlowControlDisable(ETH_MODULE_ID index)

  Summary:
    Disables the Ethernet module Automatic Flow Control logic.

  Description:
    This function disables the Ethernet Automatic Flow Control logic.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_AutoFlowControlDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_AutoFlowControlDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_AutoFlowControlIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module Automatic Flow Control status.

  Description:
    This function gets the Ethernet Automatic Flow Control enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet module Automatic Flow Control is enabled
    - false - Ethernet module Automatic Flow Control is disabled

  Example:
    <code>
    stat = PLIB_ETH_AutoFlowControlIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_AutoFlowControlIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ManualFlowControlEnable(ETH_MODULE_ID index)

  Summary:
    Enables the Ethernet Manual Flow Control logic.

  Description:
    This function enables the Ethernet Manual Flow Control logic. Enabling Manual 
    Flow Control will send a Pause frame using the Pause Timer value. While enabled, 
    a Pause frame is repeated every 128 x (Pause timer value)/2 transmit clock cycles.

    Affects both transmit and receive operations.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ManualFlowControlEnable(MY_ETH_INSTANCE);
    </code>

