venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ManualFlowControlEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ManualFlowControlDisable(ETH_MODULE_ID index)

  Summary:
    Disable Ethernet module Manual Flow Control logic.

  Description:
    This function disables the Ethernet Manual Flow Control logic and automatically 
    sends a Pause frame with a 0x0000 Pause Timer value. This function affects
    both transmit and receive operations.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ManualFlowControlDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Disabling Manual Flow Control will automatically send a Pause frame with
    a 0x0000 Pause Timer value to disable flow control.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ManualFlowControlDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_ManualFlowControlIsEnabled(ETH_MODULE_ID index)

 Summary:
    Gets the Ethernet module Manual Flow Control enable status.

  Description:
    This function returns the Ethernet module Manual Flow Control enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet module Manual Flow Control is enabled
    - false - Ethernet module Manual Flow Control is disabled

  Example:
    <code>
    stat = PLIB_ETH_ManualFlowControlIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_ManualFlowControlIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxBufferCountDecrement(ETH_MODULE_ID index)

  Summary:
    Causes the Receive Descriptor Buffer Counter to decrement by 1.

  Description:
    This function causes the Receive Descriptor Buffer Counter to decrement by 1.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxBufferCountDecrement(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Hardware increments the receive buffer counter and software decrements it.
    If the receive buffer counter is incremented by the receive logic
    at the same time, the receive buffer counter will appear unchanged.

    Always reads as '0', so there is no get value routine.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxBufferCountDecrement(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ReceiveBufferSizeSet(ETH_MODULE_ID index, uint8_t ReceiveBufferSize)

  Summary:
    Sets the Ethernet module receive buffer size.

  Description:
    This function sets the Ethernet receive buffer size. The buffer size
    is set from 16 bytes up to 2032 bytes in increments of 16 bytes each.

  Precondition:
    None.

  Parameters:
    index             - Identifier for the device instance
    ReceiveBufferSize - In units of 16 bytes, must be a value of 0x01 to 0x7F, 
                        0x00 is invalid
  
  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReceiveBufferSizeSet(MY_ETH_INSTANCE, ReceiveBufferSize/16 );
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ReceiveBufferSizeSet(ETH_MODULE_ID index, uint8_t ReceiveBufferSize);

//******************************************************************************
/* Function:
    int PLIB_ETH_RxSetBufferSize(ETH_MODULE_ID index, int rxBuffSize)

  Summary:
    Sets the Ethernet module receive buffer size.

  Description:
   This function sets the required buffer size for the receive operation.
    In this implementation, all receive descriptors use the same buffer 
	size (unlike the transmission flow where each descriptor can have 
	a different buffer size)

  Precondition:
    0 < rxBuffSize <= 2032

  Parameters:
    index             - Identifier for the device instance
    ReceiveBufferSize - In units of 16 bytes, must be a value of 0x01 to 0x7F, 
                        0x00 is invalid
  
  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReceiveBufferSizeSet(MY_ETH_INSTANCE, ReceiveBufferSize/16 );
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
	This function should be part of the initialization process and should
	NOT be called when the rx process is active! The receive buffer size 
	is always TRUNCATED to a multiple of 16 bytes.
*/
int PLIB_ETH_RxSetBufferSize(ETH_MODULE_ID index,int rxBuffSize);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_ReceiveBufferSizeGet(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module receive buffer size.

  Description:
    This function gets the Ethernet receive buffer size. The buffer size
    is set from 16 bytes up to 2032 bytes in increments of 16 bytes each.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    ReceiveBufferSize - receive buffer size divided by 16

  Example:
    <code>
    size = PLIB_ETH_ReceiveBufferSizeGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_ReceiveBufferSizeGet(ETH_MODULE_ID index);


