venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    void PLIB_ETH_TxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t *txPacketDescStartAddr)

  Summary:
    Sets the Ethernet module transmit packet descriptor start address.

  Description:
    This function sets the Ethernet transmit packet descriptor start address.

  Precondition:
    No transmit, receive, or DMA operations should be in progress when this
    function is called. Call this function before enabling transmit and
    receive.

  Parameters:
    index                 - Identifier for the device instance
    txPacketDescStartAddr - This address must be 4-byte aligned. (The least 
                            significant 2 bits must be '00'.)

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxPacketDescAddrSet(MY_ETH_INSTANCE, txPacketDescStartAddr)
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t *txPacketDescStartAddr);


//******************************************************************************
/* Function:
    uint8_t *PLIB_ETH_TxPacketDescAddrGet(ETH_MODULE_ID index)

  Summary:
    Gets the address of the next descriptor to be transmitted.

  Description:
    This function gets the address of the next transmit descriptor.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    Transmit Packet Descriptor Start Address.

  Example:
    <code>
    txPacketDescAddr = PLIB_ETH_TxPacketDescAddrGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t *PLIB_ETH_TxPacketDescAddrGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t *rxPacketDescStartAddr)

   Summary:
    Sets the Ethernet module receive packet descriptor start address.

  Description:
    This function sets the Ethernet receive packet descriptor start address.

  Precondition:
    No transmit, receive, or DMA operations should be in progress when this
    function is called. Call this function before enabling transmit and
    receive.

  Parameters:
    index                 - Identifier for the device instance
    rxPacketDescStartAddr - This address must be 4-byte aligned. (The least 
                            significant 2 bits must be '00'.)

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxPacketDescAddrSet(MY_ETH_INSTANCE, rxPacketDescStartAddr)
    </code>

  Remarks:
   This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxPacketDescAddrSet(ETH_MODULE_ID index, uint8_t *rxPacketDescStartAddr);



//******************************************************************************
/* Function:
    uint8_t *PLIB_ETH_RxPacketDescAddrGet(ETH_MODULE_ID index)

  Summary:
    Gets the address of the next receive descriptor.

  Description:
    This function gets the address of the next receive descriptor to be used.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - ReceivePacketDescriptorAddress - receive packet descriptor address

  Example:
    <code>
    RxPacketDescAddr = PLIB_ETH_RxPacketDescAddrGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t * PLIB_ETH_RxPacketDescAddrGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_HashTableSet(ETH_MODULE_ID index, uint64_t hashTableValue)

  Summary:
    Sets the Ethernet module Hash table with the new value.

  Description:
    This function sets the Hash table with the new value.

  Precondition:
    Call PLIB_ETH_HashTableFilterDisable to disable the Hash table filter
    before changing the hash table, or set the Hash Table prior to calling 
    PLIB_ETH_ReceiveEnable.

  Parameters:
    index - Identifier for the device instance
    hashTableValue - hash table value (64-bits)

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_HashTableSet(MY_ETH_INSTANCE, hashTableValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_HashTableSet(ETH_MODULE_ID index, uint64_t hashTableValue);



//******************************************************************************
/* Function:
    void  PLIB_ETH_RxFiltersHTSet ( ETH_MODULE_ID index, uint64_t htable )

  Summary:
    Sets the hash table for the hash table RX filter.

  Description:
     This function sets the hash table for the hash table RX filter.

  Precondition:
    This function should not be called when Ethernet RX operation is enabled and the
    hash filter is active.

  Parameters:
    index       - Identifier for the device instance.
    htable      - The hash table itself

  Returns:
    None.

  Example:
     <code>
    </code>

  Remarks:
    Properly set the hash table with this function before enabling the Hash
    Table filter.
*/
void  PLIB_ETH_RxFiltersHTSet ( ETH_MODULE_ID index, uint64_t htable );

//******************************************************************************
/* Function:
    uint64_t PLIB_ETH_HashTableGet(ETH_MODULE_ID index)

  Summary:
    Gets the value of the Hash table.

  Description:
    This function gets the value of the Hash table.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - hashTable - Hash table value (64-bits)

  Example:
    <code>
    value = PLIB_ETH_HashTableGet(MY_ETH_INSTANCE);
    </code>

