venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint32_t PLIB_ETH_HashTableGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PatternMatchSet(ETH_MODULE_ID index, uint64_t patternMatchMaskValue)

  Summary:
    Sets the Ethernet module pattern match mask register with the new value.

  Description:
    This function sets the pattern match mask register with the new value.

  Precondition:
    Call PLIB_ETH_PatternMatchModeSet(index,ETH_PATTERN_MATCH_DISABLED) to
    disable PatternMatch before changing the pattern match mask,
    or set the value before calling PLIB_ETH_ReceiveEnable.

  Parameters:
    index - Identifier for the device instance
    patternMatchMaskValue - Pattern Match Mask Values (64-bits)

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PatternMatchSet(MY_ETH_INSTANCE, patternMatchMaskValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PatternMatchSet(ETH_MODULE_ID index, uint64_t patternMatchMaskValue);


//******************************************************************************
/* Function:
    uint64_t PLIB_ETH_PatternMatchGet(ETH_MODULE_ID index)

  Summary:
    Gets the value of the selected pattern match mask register.

  Description:
    This function gets the selected value of the patter match mask register.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - patternMatchMaskValue - Pattern Match Mask Values

  Example:
    <code>
    value = PLIB_ETH_PatternMatchGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint64_t PLIB_ETH_PatternMatchGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PatternMatchChecksumSet(ETH_MODULE_ID index, uint16_t PatternMatchChecksumValue)

  Summary:
    Sets the Ethernet module pattern match checksum register with the new value.

  Description:
    This function sets the pattern match checksum register with the new value.

  Precondition:
    Call PLIB_ETH_PatternMatchModeSet(ETH_PATTERN_MATCH_DISABLED) to
    disable PatternMatch before changing the pattern match mask,
    or set the value before calling PLIB_ETH_ReceiveEnable.

  Parameters:
    index - Identifier for the device instance to be configured
    PatternMatchChecksumValue - Pattern match checksum value

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PatternMatchChecksumSet(MY_ETH_INSTANCE, PatternMatchChecksumValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PatternMatchChecksumSet(ETH_MODULE_ID index, uint16_t PatternMatchChecksumValue);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_PatternMatchChecksumGet(ETH_MODULE_ID index)

  Summary:
    Gets the value of the pattern match checksum register.

  Description:
    This function gets the value of the patter match checksum register.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    The pattern match checksum.

  Example:
    <code>
    value = PLIB_ETH_PatternMatchChecksumGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_PatternMatchChecksumGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PatternMatchOffsetSet(ETH_MODULE_ID index, uint16_t PatternMatchOffsetValue)

  Summary:
    Sets the Ethernet module patter match offset register with the new value.

  Description:
    This function sets the pattern match offset register with the new value.

  Precondition:
    Call PLIB_ETH_PatternMatchModeSet(ETH_PATTERN_MATCH_DISABLED) to
    disable PatternMatch before changing the pattern match mask,
    or set the value before calling PLIB_ETH_ReceiveEnable.

  Parameters:
    index - Identifier for the device instance
    PatternMatchOffsetValue - Pattern match offset value

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PatternMatchOffsetSet(MY_ETH_INSTANCE, PatternMatchOffsetValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PatternMatchOffsetSet(ETH_MODULE_ID index, uint16_t PatternMatchOffsetValue);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_PatternMatchOffsetGet(ETH_MODULE_ID index)

  Summary:
    Gets the value of the patter match offset register.

  Description:
    This function gets the value of the patter match offset register.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - PatternMatchOffsetValue - Pattern match offset value

  Example:
    <code>
    value = PLIB_ETH_PatternMatchOffsetGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/
uint16_t PLIB_ETH_PatternMatchOffsetGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PatternMatchModeSet(ETH_MODULE_ID index, ETH_PATTERN_MATCH_MODE modeSel)

  Summary:
    Sets the Ethernet module pattern match mode.

  Description:
    This function sets the pattern match mode.

  Precondition:
    Set the value before calling PLIB_ETH_ReceiveEnable().

  Parameters:
    index - Identifier for the device instance
    modeSel - The method of pattern matching from ETH_PATTERN_MATCH_DISABLED

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PatternMatchModeSet(MY_ETH_INSTANCE, ETH_PATTERN_MATCH_DISABLED);
    </code>

