venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PatternMatchModeSet(ETH_MODULE_ID index, ETH_PATTERN_MATCH_MODE modeSel);

//******************************************************************************
/* Function:
    void PLIB_ETH_RxFiltersPMClr ( ETH_MODULE_ID index )

  Summary:
    Disables the Pattern Match receive filter.

  Description:
    This function disables the Pattern Match receive filter.

  Precondition:
    This function should not be called when Ethernet RX operation is enabled.

  Parameters:
     index       - Identifier for the device instance.

  Returns:
     None.

  Example:
    <code>
    PLIB_ETH_RxFiltersPMClr(index);
    </code>

  Remarks:
 */
void PLIB_ETH_RxFiltersPMClr ( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    ETH_PATTERN_MATCH_MODE PLIB_ETH_PatternMatchModeGet(ETH_MODULE_ID index)

  Summary:
    Gets the value of the selected pattern match mask register.

  Description:
    This function gets the selected value of the patter match mask register.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - modeSel - The method of pattern matching from ETH_PATTERN_MATCH_DISABLED

  Example:
    <code>
    value = PLIB_ETH_PatternMatchModeGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

ETH_PATTERN_MATCH_MODE PLIB_ETH_PatternMatchModeGet(ETH_MODULE_ID index);



//******************************************************************************
/* Function:
    void PLIB_ETH_ReceiveFilterEnable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)

  Summary:
    Enables the specified receive filter.

  Description:
    This function enables the specified receive filter.

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance
    filter - The selection of receive filters to be enabled from the enumerated 
             selection ETH_RECEIVE_FILTER

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReceiveFilterEnable(index,
                                 ETH_CRC_OK_FILTER      |
                                 ETH_RUNT_ENABLE_FILTER |
                                 ETH_UNICAST_FILTER     );
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ReceiveFilterEnable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxFiltersSet (ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters )

  Summary:
    Sets the acceptance/rejection filters for the Ethernet receive.

  Description:
    This function sets the acceptance/rejection filters for the Ethernet receive
    mechanism.  Multiple filters can be OR-ed together.  All filter specified
    in rxFilters will be set.

  Precondition:
   This function should not be called when Ethernet RX operation is enabled.

  Parameters:
    index       - Identifier for the device instance.
    rxFilters   - RX filters that are to be set

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxFiltersSet(index,
                    ETH_FILT_CRC_ERR_REJECT | ETH_FILT_RUNT_REJECT  |
                    ETH_FILT_ME_UCAST_ACCEPT| ETH_FILT_MCAST_ACCEPT |
                    ETH_FILT_BCAST_ACCEPT   | ETH_FILT_NOTME_UCAST_ACCEPT);
    </code>

  Remarks:
    All filters except Pattern Match can be set. Use PLIB_ETH_RxFiltersPMSet().
    Before enabling the Hash Table filter, the hash table values should be set
    using PLIB_ETH_RxFiltersHTSet().
    See the definition of the ETH_RX_FILTERS for the priority of the RX filters.
*/
void PLIB_ETH_RxFiltersSet (ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters );

//******************************************************************************
/* Function:
    void PLIB_ETH_ReceiveFilterDisable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)

  Summary:
    Disables the specified receive filter.

  Description:
    This function disables the specified receive filter.

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance
    filter - The selection of receive filters to be disabled from the enumerated 
             selection ETH_RECEIVE_FILTER

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReceiveFilterDisable(index,
                                  ETH_CRC_OK_FILTER      |
                                  ETH_RUNT_ENABLE_FILTER |
                                  ETH_UNICAST_FILTER     );
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ReceiveFilterDisable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxFiltersClr (ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters )

  Summary:
     Clears the acceptance/rejection filters for the Ethernet receive.

  Description:
    This function clears the acceptance/rejection filters for the Ethernet receive
    mechanism.  Multiple filters can be OR-ed together.  All filters specified
    in rxFilters will be cleared.

  Precondition:
    This function should not be called when Ethernet RX operation is enabled.

  Parameters:
    index       - Identifier for the device instance.
    rxFilters   - RX filters that are to be cleared

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxFiltersClr(index,ETH_FILT_ALL_FILTERS);
    </code>

  Remarks:
    All filters except Pattern Match can be cleared. Use PLIB_ETH_RxFiltersPMClr().
*/
void PLIB_ETH_RxFiltersClr (ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters );

