venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    bool PLIB_ETH_ReceiveFilterIsEnable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter)

  Summary:
    Disables the specified receive filter.

  Description:
    This function disables the specified receive filter.

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance
    filter - The selection of receive filters to be disabled from the enumerated 
             selection ETH_RECEIVE_FILTER

  Returns:
    - true  - If at least one of the specified filters is enabled
    - false - If no specified filter is enabled

  Example:
    <code>
    if (PLIB_ETH_ReceiveFilterIsEnable(index, ETH_UNICAST_FILTER))
    {
        PLIB_ETH_ReceiveFilterDisable(MY_MODULE_ID, ETH_UNICAST_FILTER);
    }
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_ReceiveFilterIsEnable(ETH_MODULE_ID index, ETH_RECEIVE_FILTER filter);

//******************************************************************************
/* Function:
    void PLIB_ETH_RxFiltersWrite ( ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters )

  Summary:
    Updates the acceptance/rejection filters for the Ethernet receive.

  Description:
    This function updates the acceptance/rejection filters for the Ethernet receive
    mechanism to the required value.


  Precondition:
    This function should not be called when Ethernet RX operation is enabled.

  Parameters:
    index       - Identifier for the device instance.
    rxFilters       - RX filters that are to be written

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxFiltersWrite(index, ETH_FILT_ALL_FILTERS);
    </code>
	
  Remarks:
    All filters except Pattern Match can be updated.

    The Pattern Match filter will be disabled by this call.  Use
    PLIB_ETH_RxFiltersPMSet();

    Before enabling the Hash Table filter, the hash table values should be set
    using PLIB_ETH_RxFiltersHTSet().

    See the definition of the ETH_RX_FILTERS for the priority of the
    RX filters.
*/
void PLIB_ETH_RxFiltersWrite ( ETH_MODULE_ID index, ETH_RX_FILTERS rxFilters );


//*******************************************************************************
/*  Function:
    void PLIB_ETH_RxFiltersPMSet ( ETH_MODULE_ID index,
                                   ETH_PMATCH_MODE mode,
                                   uint64_t matchMask,
                                   uint32_t matchOffs,
                                   uint32_t matchChecksum )

  Summary:
    Enables the Pattern Match filter with the specified settings.

  Description:
    This function enables the Pattern Match filter with the specified settings
    for the offset and window mask. The calculated checksum of the 64 bytes
    window starting at matchOffs and using the matchMask bytes in the window,
    is compared against matchChecksum.  If ETH_FILT_PMATCH_INVERT is used in
    the mode, then the calculated checksum must not match the passed
    matchChecksum in order for the Pattern Match to succeed.

  Precondition:
    This function should not be called when Ethernet RX operation is enabled.

  Parameters:
    index       - Identifier for the device instance.
    mode            - The required Pattern Match Mode

    matchMask       - Mask in the 64 byte window

    matchOffs       - The offset applied to the incoming data (0 to 8128)

    matchChecksum   - The 16 bit checksum used for comparison

  Returns:

  Example:
    <code>
    PLIB_ETH_RxFiltersPMSet(index, ETH_FILT_PMATCH_ACCEPT, MY_PATTERN, 0, MY_CHECKSUM);
    </code>

  Remarks:
 */

void PLIB_ETH_RxFiltersPMSet ( ETH_MODULE_ID index,
                              ETH_PMATCH_MODE mode, uint64_t matchMask,
                              uint32_t matchOffs, uint32_t matchChecksum );


//******************************************************************************
/* Function:
    void PLIB_ETH_RxFullWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue)

  Summary:
    Sets the Ethernet module to receive a full watermark.

  Description:
    This function sets the Ethernet to receive a full watermark with a new value.

    The software controlled RX Buffer Full Watermark (Wmark) Pointer is compared
    against the receive buffer count to determine the full watermark
    condition for the full watermark interrupt and for enabling flow control
    if Auto Flow Control is enabled.

    The Full Wmark value should always be greater than the Empty Wmark value.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    watermarkValue - Full watermark value

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxFullWmarkSet(MY_ETH_INSTANCE, watermarkValue);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxFullWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_RxFullWmarkGet(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module to receive a full watermark.

  Description:
    This function gets the Ethernet to receive a full watermark.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - receiveFullWmark - Full watermark value

  Example:
    <code>
    watermarkValue = PLIB_ETH_RxFullWmarkGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_RxFullWmarkGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxEmptyWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue)

  Summary:
    Sets the Ethernet module receive empty water mark.

  Description:
    This function sets the Ethernet receive empty water mark with a new value.
    The software controlled Receive Buffer Empty Wmark is compared against
    the receive buffer count to determine the empty watermark condition
    for the empty watermark interrupt and for disabling flow control
    if Auto Flow Control is enabled.

    The Full Wmark value should always be greater than the Empty Wmark value.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    watermarkValue - Empty watermark value

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxEmptyWmarkSet(MY_ETH_INSTANCE, watermarkValue);
    </code>

