venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxEmptyWmarkSet(ETH_MODULE_ID index, uint8_t watermarkValue);



//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_RxEmptyWmarkGet(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module receive empty watermark.

  Description:
    This function gets the Ethernet receive empty watermark.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - receiveEmptyWmark - Empty watermark value

  Example:
    <code>
    watermarkValue = PLIB_ETH_RxEmptyWmarkGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_RxEmptyWmarkGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_InterruptSourceEnable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)

  Summary:
    Sets the Ethernet module Interrupt Enable register in a group, using a mask.

  Description:
    This function enables the Ethernet module interrupts by using a mask to enable
    one or multiple interrupt enables. Logically 'OR' elements of ETH_INTERRUPT_SOURCES 
    together.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    intmask - Members of ETH_INTERRUPT_SOURCES logically ORed together

  Returns:
    None.

  Example:
    <code>
    // To enable some interrupts with one command, execute the following:
    PLIB_ETH_InterruptSourceEnable(MY_ETH_INSTANCE,
                                        ETH_TRANSMIT_DONE_INTERRUPT                |
                                        ETH_TRANSMIT_ABORT_INTERRUPT               |
                                        ETH_RECEIVE_BUFFER_NOT_AVAILABLE_INTERRUPT |
                                        ETH_RECEIVE_FIFO_OVERFLOW_ERROR_INTERRUPT);

    // Or to enable one interrupt with one command, execute the following:
    PLIB_ETH_InterruptSourceEnable(MY_ETH_INSTANCE, ETH_TRANSMIT_DONE_INTERRUPT);

    // Or to enable all interrupts with one command, execute the following:
    PLIB_ETH_InterruptSourceEnable(MY_ETH_INSTANCE, ETH_ALL_ETH_INTERRUPTS);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_InterruptSourceEnable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);


//******************************************************************************
/* Function:
    void PLIB_ETH_EventsEnableSet ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents )

  Summary:
    Enables the events that will generate interrupts for the Ethernet controller.

  Description:
    The function enables the events that will generate interrupts for the Ethernet
    controller.  Multiple events can be OR-ed together.  Any event that is set
    in the eEvents will be enabled , the other events won't be touched.

  Precondition:
    None.

  Parameters:
    index    - Identifier for the device instance.
    eEvents  - Events with the significance described in the PLIB_ETH_EVENTS definition.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_EventsEnableSet(index,ETH_EV_ALL);
    </code>

  Remarks:
 */

void PLIB_ETH_EventsEnableSet ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents );


//******************************************************************************
/* Function:
    void PLIB_ETH_InterruptSourceDisable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)

  Summary:
    Clears the Ethernet module Interrupt Enable register as a group, using a mask.

  Description:
    This function disables the Ethernet module interrupts by using a mask to select
    one or multiple interrupts to disable. Logically 'OR' elements of 
    ETH_INTERRUPT_SOURCES together.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    intmask - Members of ETH_INTERRUPT_SOURCES logically ORed together

  Returns:
    None.

  Example:
    <code>
    // To disable some interrupts with one command, execute the following:
    PLIB_ETH_InterruptSourceDisble(MY_ETH_INSTANCE,
                                        ETH_TRANSMIT_DONE_INTERRUPT                |
                                        ETH_TRANSMIT_ABORT_INTERRUPT               |
                                        ETH_RECEIVE_BUFFER_NOT_AVAILABLE_INTERRUPT |
                                        ETH_RECEIVE_FIFO_OVERFLOW_ERROR_INTERRUPT );

    // Or to disable one interrupt with one command, execute the following:
    PLIB_ETH_InterruptSourceDisble(MY_ETH_INSTANCE, ETH_TRANSMIT_DONE_INTERRUPT);

    // Or to disable all interrupts with one command, execute the following:
    PLIB_ETH_InterruptSourceDisble(MY_ETH_INSTANCE, ETH_ALL_ETH_INTERRUPTS);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_InterruptSourceDisable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);

//*******************************************************************************
/*  Function:
    void PLIB_ETH_EventsEnableClr ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents )

  Summary:
    Disables the events that will generate interrupts.

  Description:
    The function disables the events that will generate interrupts for the Ethernet
    controller.  Multiple events can be OR-ed together.  Any event that is set
    in the eEvents will be disabled , the other events won't be touched.

  Precondition:
    None.

  Parameters:
    index    - Identifier for the device instance.
    eEvents  - Events with the significance described in the PLIB_ETH_EVENTS definition.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_EventsEnableClr(index,ETH_EV_ALL);
    </code>

