venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_InterruptClear(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);

//*******************************************************************************
/*  Function:
    void PLIB_ETH_EventsClr ( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents )

  Summary:
    Clears the selected events for the Ethernet controller.

  Description:
    The function clears the selected events for the Ethernet controller.  Multiple
    events can be OR-ed together. Any event that is set in the eEvents will be
    cleared, the other events won't be touched.

  Precondition:
    None.

  Parameters:
    index    - Identifier for the device instance.
    eEvents  - Events with the significance described in the PLIB_ETH_EVENTS definition.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_EventsClr(index,ETH_EV_TXDONE);
    </code>

  Remarks:
    The ETH_EV_FWMARK cannot be cleared directly. It is cleared indirectly by
    PLIB_ETH_RxAcknowledgePacket/PLIB_ETH_RxAcknowledgeBuffer.

    The ETH_EV_EWMARK cannot be cleared directly. It is cleared by hardware when
    receiving a new packet.

    The ETH_EV_PKTPEND cannot be cleared directly. It is cleared indirectly by
    PLIB_ETH_RxAcknowledgePacket/PLIB_ETH_RxAcknowledgeBuffer.

*/

void PLIB_ETH_EventsClr( ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents );


//******************************************************************************
/* Function:
bool PLIB_ETH_InterruptStatusGet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);

  Summary:
    Gets the Ethernet module Interrupt Flag register as a group, using a mask.

  Description:
    This function gets the Ethernet module Interrupt Flag register using a mask.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    intmask - Members of ETH_INTERRUPT_SOURCES logically ORed together

  Returns:
    - true  - If any of the specified source statuses are enabled
    - false - If none of the specified source statuses are enabled

  Example:
    <code>
    if (PLIB_ETH_InterruptStatusGet(index, ETH_TRANSMIT_DONE_INTERRUPT))
    {
        PLIB_ETH_InterruptClear(index, ETH_TRANSMIT_DONE_INTERRUPT);
    }
   </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_InterruptStatusGet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask);


//******************************************************************************
/* Function:
    ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptsGet(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module Interrupt Flag register as a group.

  Description:
    Gets the Ethernet module Interrupt Flag register as a group.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    Interrupt bit map, as defined in ETH_INTERRUPT_SOURCES, showing which 
    interrupts have fired.

  Example:
    <code>
   </code>

  Remarks:
    none.
*/

ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptsGet(ETH_MODULE_ID index);


/*******************************************************************************
  Function:
    PLIB_ETH_EVENTS PLIB_ETH_EventsGet ( ETH_MODULE_ID index )

  Summary:
    Returns the active events for the Ethernet controller.

  Description:
    This function returns the active events for the Ethernet controller.

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    Events with the significance described in the PLIB_ETH_EVENTS definition.

  Example:
    <code>
    ethEvents = PLIB_ETH_EventsGet(index);
    </code>

  Remarks:
 *****************************************************************************/

PLIB_ETH_EVENTS PLIB_ETH_EventsGet ( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_RxPacketCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the value of the receive packet buffer count.

  Description:
    This function gets the value of the receive packet buffer count.
    When a packet has been successfully received, this value is incremented
    by hardware. Software decrements the counter after a packet has been read.
    Call  PLIB_ETH_ReceiveBufferCountDecrement(ETH_MODULE_ID index) to decrement.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - RxPacketCount - Number of received packets in memory

  Example:
    <code>
    count = PLIB_ETH_RxPacketCountGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Receive Packet Buffer Counter cannot be decremented below 0x00
    Cleared when the Ethernet module is reset.

    The Receive Packet Buffer Count is not set to '0' when the Ethernet module
    is turned OFF. This allows software to continue to utilize and decrement
    the count.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_RxPacketCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_EthernetIsBusy(ETH_MODULE_ID index)

  Summary:
    Gets the status value of the Ethernet logic busy.

  Description:
    This function sets the value of the Ethernet logic busy. A request indicates 
    that the module has just been turned ON or is completing a transaction after 
    being turned OFF.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Ethernet logic has been turned ON or is completing a transaction
    - false - Ethernet logic is idle

  Example:
    <code>
    stat = PLIB_ETH_EthernetIsBusy(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_EthernetIsBusy(ETH_MODULE_ID index);


