venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    bool PLIB_ETH_TransmitIsBusy(ETH_MODULE_ID index)

  Summary:
    Gets the status value of the Ethernet transmit logic busy status

  Description:
    This function gets the value of the Ethernet transmit logic busy status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Transmit logic is sending data
    - false - Transmit logic is idle

  Example:
    <code>
    stat = PLIB_ETH_TransmitIsBusy(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_TransmitIsBusy(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_ReceiveIsBusy(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet receive logic busy status.

  Description:
    This function gets the Ethernet receive logic busy status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Receive logic is receiving data
    - false - Receive logic is idle

  Example:
    <code>
    stat = PLIB_ETH_ReceiveIsBusy(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_ReceiveIsBusy(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxOverflowCountClear(ETH_MODULE_ID index)

  Summary:
    Sets the value of the Ethernet receive overflow count to zero.

  Description:
    This function sets the value of the Ethernet receive overflow count to zero.
    Increment counter for frames accepted by the RX filter and subsequently
    dropped due to internal receive error. This event also sets the receive 
    overflow interrupt flag.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxOverflowCountClear(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Setting or clearing any bits in this register
    should be done for debug/test purposes only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxOverflowCountClear(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_RxOverflowCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the count of the dropped Ethernet receive frames.

  Description:
    This function gets the count of the dropped Ethernet receive frames.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - count - uint16_t receiver overflow counts

  Example:
    <code>
    count = PLIB_ETH_RxOverflowCountGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_RxOverflowCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FramesTxdOkCountClear(ETH_MODULE_ID index)

  Summary:
    Sets the count of Ethernet Control frames transmitted to zero.

  Description:
    This function sets the count of Ethernet Control frames transmitted to zero.
	This function performs atomic register access. 

	Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    value - Count of control frames transmitted correctly

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FramesTxdOkCountClear(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Setting or clearing any bits in this register should be done for 
    debug/test purposes only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FramesTxdOkCountClear(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_FramesTxdOkCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the count of Ethernet Control Frames transmitted successfully.

  Description:
    This function gets the count of Ethernet Control Frames transmitted successfully.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - count - count of control frames transmitted correctly

  Example:
    <code>
    count = PLIB_ETH_FramesTxdOkCountGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_FramesTxdOkCountGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_SingleCollisionCountClear(ETH_MODULE_ID index)

  Summary:
    Sets the value of the Ethernet single collision frame count to zero.

  Description:
    This function sets the value of the Ethernet single collision frame count to zero.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    value - Count of single collision frames

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_SingleCollisionCountClear(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_SingleCollisionCountClear(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_SingleCollisionCountGet(ETH_MODULE_ID index)

  Summary:
    Gets the count of the frames transmitted successfully on a second attempt.

  Description:
    This function gets the count of the frames transmitted successfully on
    a second attempt.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - count - Count of frames transmitted successfully on second attempt

  Example:
    <code>
    count = PLIB_ETH_SingleCollisionCountGet(MY_ETH_INSTANCE);
    </code>

