venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    void PLIB_ETH_MCSRxResetDisable(ETH_MODULE_ID index)

  Summary:
    Disables the reset EMAC Control Sub-layer/Receive domain logic.

  Description:
    This function disables the reset EMAC Control Sub-layer/Receive domain logic.
    The MCS/Receive domain logic is released from reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MCSRxResetDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MCSRxResetDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_MCSRxResetIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC Control Sub-layer/Receive domain logic reset status.

  Description:
    This function gets the EMAC Control Sub-layer/Receive domain logic reset status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true   -  EMAC Control Sub-layer/Receive domain logic is in reset
    - false  -  EMAC Control Sub-layer/Receive domain logic is not in reset

  Example:
    <code>
    stat = PLIB_ETH_MCSRxResetIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_MCSRxResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxFuncResetEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC reset receive function logic.

  Description:
    This function enables the EMAC reset receive function logic. The receive 
    function logic is held in reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxFuncResetEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxFuncResetEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxFuncResetDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC reset receive function logic.

  Description:
    This function disables the EMAC reset receive function logic. The reset receive 
    function logic is released from reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxFuncResetDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxFuncResetDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_RxFuncResetIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC reset receive function status.

  Description:
    This function gets the EMAC reset receive function status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  -  EMAC Receive function logic is held in reset
    - false -  EMAC Receive function logic is not in reset

  Example:
    <code>
    stat = PLIB_ETH_RxFuncResetIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_RxFuncResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MCSTxResetEnable(ETH_MODULE_ID index)

  Summary:
    Enables the reset of EMAC Control Sub-layer/Transmit domain logic.

  Description:
    This function resets the EMAC Control Sub-layer/Transmit domain logic.
    The MCS/Transmit domain logic is held in reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MCSTxResetEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MCSTxResetEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MCSTxResetDisable(ETH_MODULE_ID index)

  Summary:
    Disables the reset EMAC Control Sub-layer/Transmit domain logic.

  Description:
    This function disables the reset EMAC Control Sub-layer/Transmit domain logic.
    The MCS/Transmit domain logic is released from reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MCSTxResetDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MCSTxResetDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_MCSTxResetIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC Control Sub-layer/Transmit domain logic reset status.

  Description:
    This function gets the EMAC Control Sub-layer/Transmit domain logic reset status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true   -  EMAC Control Sub-layer/Transmit domain logic is held in reset
    - false  -  EMAC Control Sub-layer/Transmit domain logic is not in reset

  Example:
    <code>
    stat = PLIB_ETH_MCSTxResetIsEnabled(MY_ETH_INSTANCE);
    </code>

