venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_MCSTxResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxFuncResetEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC transmit function reset.

  Description:
    This function enables the EMAC transmit function reset. The transmit function 
    is held in reset.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxFuncResetEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxFuncResetEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxFuncResetDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC Transmit function reset.

  Description:
    This function disables the EMAC Transmit function reset. The EMAC transmit 
    function is released from reset for normal operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxFuncResetDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxFuncResetDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_TxFuncResetIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC Transmit function reset status.

  Description:
    This function gets the EMAC Transmit function reset status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - EMAC transmit function logic is held in reset
    - false - EMAC transmit function logic is not in reset

  Example:
    <code>
    PLIB_ETH_TxFuncResetIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_TxFuncResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_LoopbackEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC loopback logic.

  Description:
    This function enables the EMAC loopback logic. The EMAC transmit interface is 
    looped back to the EMAC receive interface.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_LoopbackEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_LoopbackEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_LoopbackDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC loopback logic.

  Description:
    This function disables the EMAC loopback. EMAC resumes normal operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_LoopbackDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_LoopbackDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_LoopbackIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC Loopback interface enable status.

  Description:
    This function gets the EMAC Loopback interface enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - EMAC transmit interface is looped back to the EMAC receive interface
    - false - EMAC normal operation

  Example:
    <code>
    stat = PLIB_ETH_LoopbackIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_LoopbackIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxPauseEnable(ETH_MODULE_ID index)

  Summary:
    Enables the transmission Pause frames.

  Description:
    This function enables the transmission Pause frames. The Pause frames are 
    allowed for transmission.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxPauseEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxPauseEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_TxPauseDisable(ETH_MODULE_ID index)

  Summary:
    Disables the transmission of Pause frames.

  Description:
    This function disables the transmit Pause frames. The Pause frames are blocked 
    from being transmitted.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_TxPauseDisable(MY_ETH_INSTANCE);
    </code>

