venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_TxPauseDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_TxPauseIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet module enable status.

  Description:
    This function gets the Ethernet module enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Pause Flow Control frames are allowed to be transmitted
    - false - Pause Flow Control frames are blocked

  Example:
    <code>
    status = PLIB_ETH_TxPauseIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_TxPauseIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxPauseEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC receive flow control.

  Description:
    This function enables the EMAC receive flow control. The EMAC will act upon 
    the received Pause frames.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxPauseEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxPauseEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RxPauseDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC receive flow control.

  Description:
    This function disables the EMAC receive flow control. The received Pause Flow 
    control frames are ignored.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RxPauseDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RxPauseDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_RxPauseIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC receive flow pause enable status.

  Description:
    This function gets the EMAC receive flow pause enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC acts upon received Pause Flow Control frames
    - false - Received Pause Flow Control frames are ignored

  Example:
    <code>
    status = PLIB_ETH_RxPauseIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_RxPauseIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PassAllEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC PassAll.

  Description:
    This function enables the EMAC PassAll, which enables both the normal and
    the control frames to be passed.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PassAllEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PassAllEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PassAllDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC PassAll.

  Description:
    This function disables the EMAC PassAll. Control frames are ignored.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PassAllDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PassAllDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_PassAllIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC PassAll enable status.

  Description:
    This function gets the EMAC PassAll enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC will accept all frames regardless of type
              (normal vs. Control)
    - false - The received Control frames are ignored

  Example:
    <code>
    stat = PLIB_ETH_PassAllIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_PassAllIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ReceiveEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC to receive the frames.

  Description:
    This function enables the EMAC to receive the frames.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReceiveEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

