venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
void PLIB_ETH_ReceiveEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ReceiveDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC from receiving frames.

  Description:
    This function disables the EMAC from receiving frames.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReceiveDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ReceiveDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_ReceiveIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the Ethernet EMAC receive enable status.

  Description:
    This function gets the Ethernet EMAC receive enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Enable the EMAC to receive frames
    - false - Disable the EMAC to receive frames

  Example:
    <code>
    stat = PLIB_ETH_ReceiveIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_ReceiveIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ExcessDeferEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC excess defer.

  Description:
    This function enables EMAC excess defer. The EMAC will defer to the carrier 
    indefinitely.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ExcessDeferEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ExcessDeferEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ExcessDeferDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC excess defer.

  Description:
    This function disables EMAC excess defer. The EMAC will abort when the 
    excessive deferral limit is reached.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ExcessDeferDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ExcessDeferDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_ExcessDeferIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC excess defer enable status.

  Description:
    This function gets the EMAC excess defer enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC will defer to carrier indefinitely as per the Standard
    - false - The EMAC will abort when the excessive deferral limit is reached

  Example:
    <code>
    stat = PLIB_ETH_ExcessDeferIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_ExcessDeferIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_BackPresNoBackoffEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC back pressure/no back-off.

  Description:
    This function enables EMAC backpressure/no back-off. The EMAC will not back-off 
    when there is backpressure and collisions occur.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_BackPresNoBackoffEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    The EMAC after incidentally causing a collision during backpressure will
    immediately retransmit without back-off reducing the chance of further
    collisions and ensuring transmit packets get sent.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_BackPresNoBackoffEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_BackPresNoBackoffDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC backpressure/no back-off.

  Description:
    This function disables EMAC backpressure/no back-off. The EMAC will back-off 
    when there is backpressure and collisions occur.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_BackPresNoBackoffDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_BackPresNoBackoffDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_BackPresNoBackoffIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC backpressure/no back-off enable status.

  Description:
    This function gets the EMAC backpressure/no back-off enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC after incidentally causing a collision during
              backpressure will immediately retransmit without back-off
              reducing the chance of further collisions and ensuring
              transmit packets get sent
    - false - The EMAC will not remove the back-off

  Example:
    <code>
    stat = PLIB_ETH_BackPresNoBackoffIsEnabled(MY_ETH_INSTANCE);
    </code>

