venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_BackPresNoBackoffIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_NoBackoffEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC no back-off.

  Description:
    This function enables EMAC no back-off. The EMAC will not back-off when a 
    collision occurs.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_NoBackoffEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    Following a collision, the EMAC will immediately retransmit rather than
    using the Binary Exponential Back-off algorithm as specified in the Standard.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_NoBackoffEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_NoBackoffDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC no back-offs.

  Description:
    This function disables EMAC no back-off. The EMAC will back-off when a 
    collision occurs.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_NoBackoffDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_NoBackoffDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_NoBackoffIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC no back-off enable status.

  Description:
    This function gets the EMAC no back-off enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Following a collision, the EMAC will immediately retransmit
    - false - Following a collision, the EMAC will use the Binary Exponential 
              Back-off algorithm

  Example:
    <code>
    stat = PLIB_ETH_NoBackoffIsEnabled(MY_ETsH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_NoBackoffIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_LongPreambleEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC long preamble enforcement.

  Description:
    This function enables EMAC long preamble enforcement. The EMAC only allows 
    receive packets which contain preamble fields less than 12 bytes in length.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_LongPreambleEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_LongPreambleEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_LongPreambleDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC long preamble enforcement.

  Description:
    This function disables EMAC long preamble enforcement. The EMAC allows any 
    length preamble.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_LongPreambleDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_LongPreambleDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_LongPreambleIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC long preamble enforcement enable status.

  Description:
    This function gets the EMAC long preamble enforcement enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC only allows receive packets, which contain preamble fields 
              less than 12 bytes in length
    - false - The EMAC allows any length preamble

  Example:
    <code>
    stat = PLIB_ETH_LongPreambleIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_LongPreambleIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PurePreambleEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC pure preamble enforcement.

  Description:
    This function enables EMAC pure preamble enforcement. The EMAC will verify 
    the contents of the preamble and discard packets with errors in the preamble.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PurePreambleEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    The EMAC will verify the content of the preamble to ensure it contains 0x55 
    and is error-free. A packet with errors in its preamble is discarded.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PurePreambleEnable(ETH_MODULE_ID index);


