venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    void PLIB_ETH_PurePreambleDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC pure preamble enforcement.

  Description:
    This function disables the EMAC pure preamble enforcement. The EMAC does not 
    perform any preamble checking.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PurePreambleDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PurePreambleDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_PurePreambleIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets EMAC pure preamble enforcement enable status.

  Description:
    This function gets the EMAC pure preamble enforcement enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC will verify the content of the preamble to ensure it
              contains 0x55 and is error-free. A packet with errors in its 
              preamble is discarded.
    - false - The EMAC does not perform any preamble checking

  Example:
    <code>
    stat = PLIB_ETH_PurePreambleIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_PurePreambleIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_AutoDetectPadClear(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option );

  Summary:
    Clears the EMAC Auto-Pad option.

  Description:
    This function sets the EMAC Auto-Pad option. If any auto-pad option other
    than ETH_AUTOPAD_DISABLED_CHECK_CRC is selected, the CRC must be enabled by 
    PLIB_ETH_CRCEnable.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_AutoDetectPadClear(MY_ETH_INSTANCE, PAD_OPTION);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.

*/

void PLIB_ETH_AutoDetectPadClear(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option );


//******************************************************************************
/* Function:
    void PLIB_ETH_AutoDetectPadSet(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option );

  Summary:
    Sets the EMAC Auto-Pad option.

  Description:
    This function sets the EMAC Auto-Pad option. If any auto-pad option other than 
    ETH_AUTOPAD_DISABLED_CHECK_CRC is selected, the CRC must be enabled by 
    PLIB_ETH_CRCEnable.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_AutoDetectPadSet(MY_ETH_INSTANCE, PAD_OPTION);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.

*/

void PLIB_ETH_AutoDetectPadSet(ETH_MODULE_ID index, ETH_AUTOPAD_OPTION option );

/*DOM-IGNORE-BEGIN*/
//PLIB_ETH_AutoDetectPadSet() will set  bits AUTOPAD, VLANPAD, and PADENABLE.
// Software must also enable CRC.
//  See the FRM PAD Operation Table.
/*DOM-IGNORE-END*/


//******************************************************************************
/* Function:
    ETH_AUTOPAD_OPTION PLIB_ETH_AutoDetectPadGet(ETH_MODULE_ID index);

  Summary:
    Gets the current EMAC Auto-Pad setting.

  Description:
    This function gets the current EMAC Auto-Pad setting.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    ETH_AUTOPAD_OPTION.

  Example:
    <code>
    autoPadOption = PLIB_ETH_AutoDetectPadGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

ETH_AUTOPAD_OPTION PLIB_ETH_AutoDetectPadGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_CRCEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC CRC.

  Description:
    This function enables EMAC CRC. The EMAC will append CRC whether padding is 
    required or not. This must be enabled if auto-padding is enabled.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_CRCEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_CRCEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_CRCDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC CRC.

  Description:
    This function disables EMAC CRC.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_CRCDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    The frames presented to the EMAC have a valid CRC

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_CRCDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_CRCIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC CRC enable status.

  Description:
    This function returns the EMAC CRC enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC will append a CRC to every frame whether or not padding
              was required. Must be set if auto-padding is enabled.
    - false - The frames presented to the EMAC have a valid CRC

  Example:
    <code>
    stat = PLIB_ETH_CRCIsEnabled(MY_ETH_INSTANCE);
    </code>

