venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_CRCIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_DelayedCRCEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC delayed CRC.

  Description:
    This function enables EMAC delayed CRC. A proprietary packet header exists. Four
    bytes of the packet header are ignored by the CRC function.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_DelayedCRCEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_DelayedCRCEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_DelayedCRCDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC delayed CRC.

  Description:
    This function disables EMAC delayed CRC. No proprietary header exists.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_DelayedCRCDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_DelayedCRCDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_DelayedCRCIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC delayed CRC enable status.

  Description:
    This function returns the EMAC delayed CRC enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - A proprietary header exists. Four bytes of packet header are ignored
              by the CRC function.
    - false - No proprietary header

  Example:
    <code>
    stat = PLIB_ETH_DelayedCRCIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_DelayedCRCIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_HugeFrameEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC to receive huge frames.

  Description:
    This function enables the EMAC receiving the frames of any length.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_HugeFrameEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_HugeFrameEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_HugeFrameDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC from receiving huge frames.

  Description:
    This function disables the EMAC from receiving huge frames.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_HugeFrameDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_HugeFrameDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_HugeFrameIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC huge frame enable status.

  Description:
    This function returns the EMAC huge frame enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Frames of any length are transmitted and received
    - false - Huge frames are not allowed for receive or transmit

  Example:
    <code>
    stat = PLIB_ETH_HugeFrameIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_HugeFrameIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FrameLengthCheckEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC frame length check.

  Description:
    This function enables the EMAC frame length check. Both transmit and receive 
    frame lengths are compared to the Length/Type field. If the Length/Type field 
    represents a length, the check is performed. Mismatches are reported on the
    transmit/receive statistics vector.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FrameLengthCheckEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FrameLengthCheckEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FrameLengthCheckDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC frame length check.

  Description:
    This function disables the EMAC frame length check.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FrameLengthCheckDisable(MY_ETH_INSTANCE);
    </code>

