venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FrameLengthCheckDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_FrameLengthCheckIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC frame length check status.

  Description:
    This function returns the EMAC frame length check status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Both transmit and receive frame lengths are compared to
              the Length/Type field. If the Length/Type field represents
              a length then the check is performed. Mismatches are reported
              on the transmit/receive statistics vector.
    - false - Length/Type field check is not performed

  Example:
    <code>
    stat = PLIB_ETH_FrameLengthCheckIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_FrameLengthCheckIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FullDuplexEnable(ETH_MODULE_ID index)

  Summary:
    Enables the EMAC full duplex operation.

  Description:
    This function enables the EMAC full duplex operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FullDuplexEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FullDuplexEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_FullDuplexDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC full duplex operation.

  Description:
    This function disables the EMAC full-duplex operation, which results in the
    EMAC operating in half-duplex.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_FullDuplexDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_FullDuplexDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_FullDuplexIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC full duplex enable status.

  Description:
    This function returns the EMAC full duplex enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC operates in Full-Duplex mode
    - false - The EMAC operates in Half-Duplex mode

  Example:
    <code>
    stat = PLIB_ETH_FullDuplexIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_FullDuplexIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_BackToBackIPGSet(ETH_MODULE_ID index, uint8_t backToBackIPGValue)

  Summary:
    Sets the EMAC back-to-back interpacket gap.

  Description:
    This function sets the EMAC back-to-back interpacket gap.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    backToBackIPGValue - Back-to-back interpacket gap

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_BackToBackIPGSet(MY_ETH_INSTANCE, backToBackIPGValue);
    </code>

  Remarks:
    In Full-Duplex mode, the register value should be the desired period
    in nibble times minus 3. In Full-Duplex, the recommended setting is 0x15.

    In Half-Duplex mode, the register value should be the desired period
    in nibble times minus 6. n Half-Duplex, the recommended setting is 0x12.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_BackToBackIPGSet(ETH_MODULE_ID index, uint8_t backToBackIPGValue);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_BackToBackIPGGet(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC back-to-back interpacket gap.

  Description:
    This function gets the EMAC back-to-back interpacket gap.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - backToBackIPGValue - Back-to-back interpacket gap (7 bits)

  Example:
    <code>
    value = PLIB_ETH_BackToBackIPGGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_BackToBackIPGGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_NonBackToBackIPG1Set(ETH_MODULE_ID index, uint8_t nonBackToBackIPGValue)

  Summary:
    Sets the EMAC non-back-to-back interpacket gap register 1.

  Description:
    This function sets the EMAC non-back-to-back interpacket gap register 1.
    A value of 0x0C is recommended.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    nonBackToBackIPGValue - Non-back-to-back interpacket gap

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_NonBackToBackIPG1Set(MY_ETH_INSTANCE, nonBackToBackIPGValue);
    </code>

