venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This is a programmable field representing the optional carrierSense window
    referenced in the IEEE 802.3 Specification.
    If a carrier is detected during the timing of IPGR1, the MAC defers to the carrier.
    If, however, the carrier comes after IPGR1, the MAC continues timing IPGR2 and
    transmits, knowingly causing a collision, thereby ensuring fair access to the medium.
    Its range of values is 0x0 to IPGR2. Its recommended value is 0xC (12d).

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_NonBackToBackIPG1Set(ETH_MODULE_ID index, uint8_t nonBackToBackIPGValue);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_NonBackToBackIPG1Get(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC non-back-to-back interpacket gap register 1.

  Description:
    This function gets the EMAC non-back-to-back interpacket gap register 1.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - nonBackToBackIPGValue - Non-back-to-back interpacket gap (7 bits)

  Example:
    <code>
    value = PLIB_ETH_NonBackToBackIPG1Get(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_NonBackToBackIPG1Get(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_NonBackToBackIPG2Set(ETH_MODULE_ID index, uint8_t nonBackToBackIPGValue)

  Summary:
    Sets the EMAC non-back-to-back interpacket gap register 2.

  Description:
    This function sets the EMAC non-back-to-back interpacket gap register 2.
    A value of 0x12 is recommended.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    nonBackToBackIPGValue - Non-back-to-back interpacket gap

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_NonBackToBackIPG2Set(MY_ETH_INSTANCE, nonBackToBackIPGValue);
    </code>

  Remarks:
    This is a programmable field representing the non-back-to-back
    Inter-Packet-Gap. Its recommended value is 0x12 (18d), which represents
    the minimum IPG of 0.96 us (in 100 Mbps) or 9.6 us (in 10 Mbps).

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_NonBackToBackIPG2Set(ETH_MODULE_ID index, uint8_t nonBackToBackIPGValue);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_NonBackToBackIPG2Get(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC non-back-to-back interpacket gap register 2.

  Description:
    This function gets the EMAC non-back-to-back interpacket gap register 2.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - nonBackToBackIPGValue - Non-back-to-back interpacket gap (7 bits)

  Example:
    <code>
    value = PLIB_ETH_NonBackToBackIPG2Get(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_NonBackToBackIPG2Get(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_CollisionWindowSet(ETH_MODULE_ID index, uint8_t collisionWindowValue)

  Summary:
    Sets the EMAC collision window.

  Description:
    This function sets the EMAC collision window.
	This function performs atomic register access. 

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    collisionWindowValue - Collision window

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_CollisionWindowSet(MY_ETH_INSTANCE, collisionWindowValue);
    </code>

  Remarks:
    This is a programmable field representing the slot time or collision window
    during which collisions occur in properly configured networks. Since the
    collision window starts at the beginning of transmission, the preamble
    and SFD is included. Its default of 0x37 (55d) corresponds to the count of
    frame bytes at the end of the window.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_CollisionWindowSet(ETH_MODULE_ID index, uint8_t collisionWindowValue);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_CollisionWindowGet(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC collision window.

  Description:
    This function gets the EMAC collision window.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - collisionWindowValue - A uint8_t (6-bit) value.

  Example:
    <code>
    value = PLIB_ETH_CollisionWindowGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_CollisionWindowGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ReTxMaxSet(ETH_MODULE_ID index, uint8_t retransmitMax)

  Summary:
    Sets the EMAC maximum retransmissions.

  Description:
    This function sets the EMAC maximum retransmissions.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    retransmitMax - Maximum number of retransmissions

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ReTxMaxSet(retransmitMax);
    </code>

  Remarks:
    This is a programmable field specifying the number of retransmission
    attempts following a collision before aborting the packet due to excessive
    collisions. The IEEE 802.3 Specification standard specifies the maximum
    number of attempts (attemptLimit) to be 0xF (15d). Its default is 000.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ReTxMaxSet(ETH_MODULE_ID index, uint16_t retransmitMax);


