venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_ReTxMaxGet(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC maximum retransmissions.

  Description:
    This function gets the EMAC maximum retransmissions.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - retransmitMax - Maximum number of retransmissions

  Example:
    <code>
    value = PLIB_ETH_ReTxMaxGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    The maximum number of attempts is limited to 0x0F.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_ReTxMaxGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MaxFrameLengthSet(ETH_MODULE_ID index, uint16_t MaxFrameLength)

  Summary:
    Sets the EMAC maximum frame length.

  Description:
    This function sets the EMAC maximum frame length.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    MaxFrameLength - Maximum frame length

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MaxFrameLengthSet(MY_ETH_INSTANCE, MaxFrameLength);
    </code>

  Remarks:
    This field resets to 0x05EE, which represents a maximum receive
    frame of 1518 bytes.
    An untagged maximum size Ethernet frame is 1518 bytes.
    A tagged frame adds four octets for a total of 1522 bytes.
    If a shorter/longer maximum length restriction is desired, program
    this 16-bit field.

    If a proprietary header is allowed, this field should be adjusted 
    accordingly. For example, if 4-byte headers are prepended to frames, 
    MACMAXF could be set to 1527 bytes. This would allow the maximum VLAN 
    tagged frame plus the 4-byte header.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MaxFrameLengthSet(ETH_MODULE_ID index, uint16_t MaxFrameLength);

//******************************************************************************
/* Function:
    void PLIB_ETH_MACSetMaxFrame(ETH_MODULE_ID index,uint16_t maxFrmSz)

  Summary:
    Sets the MAC maximum frame size.

  Description:
    This function sets the EMAC maximum frame length.

  Precondition:
    Should be called after PLIB_ETH_Init().

  Parameters:
    index       - Identifier for the device instance.
    maxFrmSz    - Maximum frame for the MAC to transmit or receive.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MACSetMaxFrame(index,0x800);
    </code>

  Remarks:
    The default MAC frame size (0x600) is set by the PLIB_ETH_Init() call.
*/

void PLIB_ETH_MACSetMaxFrame(ETH_MODULE_ID index,uint16_t maxFrmSz);

//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_MaxFrameLengthGet(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC maximum frame length.

  Description:
    This function gets the EMAC maximum frame length.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - MaxFrameLength - Maximum frame length

  Example:
    <code>
    value = PLIB_ETH_MaxFrameLengthGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_MaxFrameLengthGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RMIIResetEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC Reset RMII.

  Description:
    This function enables EMAC Reset RMII.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RMIIResetEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RMIIResetEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RMIIResetDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC Reset RMII.

  Description:
    This function disables EMAC Reset RMII for normal operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RMIIResetDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_RMIIResetDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_RMIIResetIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC Reset RMII enable status.

  Description:
    This function gets the EMAC Reset RMII enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Reset the EMAC RMII module
    - false - Normal operation

  Example:
    <code>
    stat = PLIB_ETH_RMIIResetIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_RMIIResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RMIISpeedSet(ETH_MODULE_ID index, ETH_RMII_SPEED RMIISpeed)

  Summary:
    Sets EMAC RMII Speed.

  Description:
    This function sets EMAC RMII speed. RMII speed can be either RMII_100Mbps or 
    RMII_10Mbps.

  Precondition:
    None.

  Parameters:
    index     - Identifier for the device instance
    RMIISpeed - RMII_100Mbps or RMII_10Mbps of type ETH_RMII_SPEED

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RMIISpeedSet(MY_ETH_INSTANCE, ETH_RMII_SPEED RMIISpeed);
    </code>

