venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    void PLIB_ETH_ShortcutQuantaEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC shortcut pause quanta.

  Description:
    This function enables EMAC shortcut pause quanta. The EMAC reduces the effective 
    pause quanta from 64 byte-times to 1 byte-time.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ShortcutQuantaEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is intended for testing only.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ShortcutQuantaEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_ShortcutQuantaDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC shortcut pause quanta.

  Description:
    This function disables EMAC shortcut pause quanta. The EMAC will resume normal 
    operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_ShortcutQuantaDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_ShortcutQuantaDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_ShortcutQuantaIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets EMAC shortcut pause quanta enable status.

  Description:
    This function returns EMAC shortcut pause quanta enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The EMAC reduces the effective Pause Quanta from 64 byte-times
              to 1 byte-time
    - false - Normal operation

  Example:
    <code>
    stat = PLIB_ETH_ShortcutQuantaIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_ShortcutQuantaIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMResetEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC Reset Media Independent Interface (MII) Management.

  Description:
    This function enables EMAC Reset MII Management and holds the MII Management 
    module in reset while enabled.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMResetEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    MII Management held in Reset after This function is called. Disable ResetMIIanagement 
    to return to normal operation.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMResetEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMResetDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC Reset MII Management.

  Description:
    This function disables EMAC Reset MII Management.
    EMAC will resume normal operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMResetDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMResetDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_MIIMResetIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC Reset MII Management enable status.

  Description:
    This function gets the EMAC Reset MII Management enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - Reset the MII Management module
    - false - Normal operation

  Example:
    <code>
    stat = PLIB_ETH_MIIMResetIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_MIIMResetIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMClockSet(ETH_MODULE_ID index, ETH_MIIM_CLK MIIMClock)

  Summary:
    Sets the EMAC MIM clock selection.

  Description:
    This function sets the EMAC MIIM clock selection.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    MIIMClock - of type ETH_MIIM_CLK - the system clock divisor for MII

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMClockSet(MY_ETH_INSTANCE, MIIMClock);
    </code>

  Remarks:
    This field is used by the clock divide logic in creating the MII Management 
    Clock (MDC), which the IEEE 802.3 Specification defines to be no faster than 
    2.5 MHz. Some PHYs support clock rates up to 12.5 MHz.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMClockSet(ETH_MODULE_ID index, ETH_MIIM_CLK MIIMClock);


//******************************************************************************
/* Function:
    ETH_MII_CLK PLIB_ETH_MIIMClockGet(ETH_MODULE_ID index)

  Summary:
    Gets the current EMAC MIIM clock selection.

  Description:
    This function returns the current EMAC MIIM clock selection.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - MIIMClock - Of type PLIB_ETH_MIIM_CLK

  Example:
    <code>
    clkstat = PLIB_ETH_MIIMClockGet(MY_ETH_INSTANCE);
    </code>

