venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

ETH_MIIM_CLK PLIB_ETH_MIIMClockGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMNoPreEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC MIIM No Preamble (suppresses preamble).

  Description:
    This function enables EMAC MIIM No Preamble (suppresses preamble). The MII 
    Management will perform read/write cycles without the 32-bit preamble field.
    Some PHYs support suppressed preamble.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMNoPreEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMNoPreEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMNoPreDisable(ETH_MODULE_ID index)

  Summary:
    Disables EMAC No Preamble (allows preamble).

  Description:
    This function disables EMAC No preamble (allows preamble). Normal read/write 
    cycles are performed.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMNoPreDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMNoPreDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_MIIMNoPreIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC MIIM No Preamble enable status.

  Description:
    This function gets the EMAC MIIM No Preamble enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The MII Management will perform read/write cycles without the 32-bit 
              preamble field. Some PHYs support suppressed preamble.
    - false - Normal read/write cycles are performed

  Example:
    <code>
    stat = PLIB_ETH_MIIMNoPreIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_MIIMNoPreIsEnabled(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMScanIncrEnable(ETH_MODULE_ID index)

  Summary:
    Enables EMAC MIIM Scan Increment.

  Description:
    This function enables EMAC MIIM Scan Increment. The MII Management module will 
    perform read cycles across a range of PHYs. The read cycles will start from 
    address 1 through the value set in the PHY address register.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMScanIncrEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    The read cycles will start at PHY address 1 and continue through the value
    set for as the PHY address register.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMScanIncrEnable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMScanIncrDisable(ETH_MODULE_ID index)

  Summary:
    Disables the EMAC MIIM Scan Increment.

  Description:
    This function disables the EMAC MIIM Scan Increment. Allows continuous reads 
    of the same PHY.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMScanIncrDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMScanIncrDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_MIIMScanIncrIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC MIIM scan increment enable status.

  Description:
    This function gets the EMAC MIIM scan increment enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The MII Management module will perform read cycles across a range of 
              PHYs. The read cycles will start from address 1 through the value set 
              in the PHY address register.
    - false - Continuous reads of the same PHY

  Example:
    <code>
    ScanIncrement = PLIB_ETH_MIIMScanIncrIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_MIIMScanIncrIsEnabled(ETH_MODULE_ID index);



//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMScanModeEnable(ETH_MODULE_ID index)

  Summary:
    Enables MIIM scan mode.

  Description:
    This function enables MIIM scan mode. The MII Management module will perform 
    read cycles continuously. (Useful for monitoring the Link Fail.)

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMScanModeEnable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMScanModeEnable(ETH_MODULE_ID index);


