venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMScanModeDisable(ETH_MODULE_ID index)
  Summary:
    Disables MIIM scan mode.

  Description:
    This function disables MIIM scan mode. Scan is disabled for Normal operation.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMScanModeDisable(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMScanModeDisable(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_MIIMScanModeIsEnabled(ETH_MODULE_ID index)

  Summary:
    Gets the MII management scan enable status.

  Description:
    This function returns the MII management scan enable status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The MII Management module will perform read cycles continuously
              (for example, useful for monitoring the Link Fail)
    - false - Normal operation

  Example:
    <code>
    stat = PLIB_ETH_MIIMScanModeIsEnabled(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_MIIMScanModeIsEnabled(ETH_MODULE_ID index);



//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMReadStart(ETH_MODULE_ID index)

  Summary:
    Initiates an MII management read command.

  Description:
    This function initiates an MII read command. The MII Management module will 
    perform a single read cycle. To get data, use PLIB_ETH_MIIMReadDataGet.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    while (PLIB_ETH_MIIMIsBusy(MY_ETH_INSTANCE))
    {
        //Wait until MII Link is not busy
    }
    PLIB_ETH_MIIReadStart(MY_ETH_INSTANCE);
    while (PLIB_ETH_MIIMIsBusy(MY_ETH_INSTANCE))
    {
        //Wait until read is complete
    }
    data = PLIB_ETH_MIIMReadDataGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMReadStart(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMWriteStart(ETH_MODULE_ID index)

  Summary:
    Initiates an MII management write command.

  Description:
    This function initiates an MII management read command. The MII Management module 
    will perform a write cycle.

  Precondition:
    The PHY address and MII register address must be configured before a write
    using PLIB_ETH_MIIPHYAddressSet(MY_ETH_INSTANCE, phyAddr)   and
    PLIB_ETH_MIIRegisterAddressSet(MY_ETH_INSTANCE, regAddr)

    Data to be written must be first loaded into the MII write register using
    PLIB_ETH_MIIMWriteDataSet(MY_ETH_INSTANCE, writeData)

  Parameters:
    index - Identifier for the device instance

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMWriteDataSet(MY_ETH_INSTANCE, dataToWrite);
    PLIB_ETH_MIIMWriteStart(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMWriteStart(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_PHYAddressSet(ETH_MODULE_ID index, uint8_t phyAddr)

  Summary:
    Sets the EMAC MIIM PHY address.

  Description:
    This function sets the EMAC MIIM PHY address. This field represents the 5-bit 
    PHY Address field of Management cycles. Up to 31 PHYs can be addressed (0 is reserved).

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    phyAddr - A 5-bit address of the PHY

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_PHYAddressSet(MY_ETH_INSTANCE, PhyAddr);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_PHYAddressSet(ETH_MODULE_ID index, uint8_t phyAddr);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_PHYAddressGet(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC MIIM management PHY address.

  Description:
    This function gets the EMAC MIIM management PHY address.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - phyAddr - A 5-bit address of the PHY

  Example:
    <code>
    phyAddr = PLIB_ETH_PHYAddressGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_PHYAddressGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_RegisterAddressSet(ETH_MODULE_ID index, uint8_t regAddr)

  Summary:
    Sets EMAC MIIM register address.

  Description:
    This function sets the EMAC MIIM register address. Up to 32 registers may 
    be accessed.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    regAddr - The (5-bit) address of the MII Registers.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_RegisterAddressSet(MY_ETH_INSTANCE, regAddr);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

