venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
void PLIB_ETH_RegisterAddressSet(ETH_MODULE_ID index, uint8_t regAddr);


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_RegisterAddressGet(ETH_MODULE_ID index)

  Summary:
    Gets the EMAC MIIM management register address.

  Description:
    This function gets the EMAC MIIM management register address.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - regAddr - The (5-bit) address of the MII Registers

  Example:
    <code>
    regAddr = PLIB_ETH_RegisterAddressGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_RegisterAddressGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_MIIMWriteDataSet(ETH_MODULE_ID index, uint16_t writeData)

  Summary:
    Sets the EMAC MIIM write data before initiating an MII write cycle.

  Description:
    This function sets the EMAC MIIM write data before initiating write cycle.

  Precondition:
    Prior to a call to this routine, the PHY and Register addresses
    should be set using PLIB_ETH_MIIPHYAddressSet and PLIB_ETH_MIIRegisterAddressSet.

  Parameters:
    index - Identifier for the device instance
    writeData - MII write data

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_MIIMWriteDataSet(MY_ETH_INSTANCE, WriteData);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_MIIMWriteDataSet(ETH_MODULE_ID index, uint16_t writeData);


//******************************************************************************
/* Function:
    uint16_t PLIB_ETH_MIIMReadDataGet(ETH_MODULE_ID index)

  Summary:
    Gets EMAC MIIM management read data after a MII read cycle has completed.

  Description:
    This function gets EMAC MIIM management read data after a MII read cycle
    has completed.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - readData - MII read data

  Example:
    <code>
    readData = PLIB_ETH_MIIMReadDataGet(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint16_t PLIB_ETH_MIIMReadDataGet(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_LinkHasFailed(ETH_MODULE_ID index)

  Summary:
    Gets the MII management link fail status.

  Description:
    This function returns the MII management link fail status. This value reflects 
    the last read from the PHY status register.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The MII Management module link fail has occurred
    - false - The MII Management module link fail has not occurred

  Example:
    <code>
    stat = PLIB_ETH_LinkHasFailed(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_LinkHasFailed(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_DataNotValid(ETH_MODULE_ID index)

  Summary:
    Gets the MII management read data not valid status.

  Description:
    This function gets the MII management read data not valid status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The MII Management read cycle has not completed and the read data
              is not yet valid
    - false - The MII Management read cycle is complete and the read data is valid

  Example:
    <code>
    stat = PLIB_ETH_DataNotValid(MY_ETH_INSTANCE);
    </code>
    Also see the example for function: PLIB_ETH_MIIReadStart().

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_DataNotValid(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_MIIMIsScanning(ETH_MODULE_ID index)

  Summary:
    Gets the MII Management scanning status.

  Description:
    This function gets the MII Management scanning status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The MII Management module scan operation (continuous MII Management 
              Read cycles) is in progress
    - false - The MII Management scan operation is not in progress

  Example:
    <code>
    stat = PLIB_ETH_MIIMIsScanning(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

bool PLIB_ETH_MIIMIsScanning(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    bool PLIB_ETH_MIIMIsBusy(ETH_MODULE_ID index)

  Summary:
    Gets the MII management busy status.

  Description:
    This function returns the MII management busy status.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance

  Returns:
    - true  - The MII Management module is currently performing an MII Management 
              read or write cycle
    - false - The MII Management is free

  Example:
    <code>
    stat = PLIB_ETH_MIIMIsBusy(MY_ETH_INSTANCE);
    </code>

  Remarks:
    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

