venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
bool PLIB_ETH_MIIMIsBusy(ETH_MODULE_ID index);


//******************************************************************************
/* Function:
    void PLIB_ETH_StationAddressSet(ETH_MODULE_ID index, uint8_t which, uint8_t stationAddress)

  Summary:
    Sets the selected EMAC Station Address.

  Description:
    This function sets the selected EMAC Station Address.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    which - Select station address to change. Valid values are 1,2,3,4,5,6.
    stationAddress - Station Address.

  Returns:
    None.

  Example:
    <code>
    PLIB_ETH_StationAddressSet(MY_ETH_INSTANCE, which, stationAddress);
    </code>

  Remarks:
    On a reset, this register is loaded with the factory preprogrammed
    station address.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

void PLIB_ETH_StationAddressSet(ETH_MODULE_ID index, uint8_t which, uint8_t stationAddress);

//******************************************************************************
/* Function:
     void PLIB_ETH_MACSetAddress (ETH_MODULE_ID index, uint8_t *bAddress )

  Summary:
    Sets the MAC address.

  Description:
    This function sets the selected MAC Station Address.

  Precondition:
    None.

  Parameters:
    index       - Identifier for the device instance.
    bAddress    - standard MAC address, 6 bytes, Network order!

  Returns:
    None.

  Example:
    <code>
    uint8_t hostAddress[6]= { 0x00, 0x04, 0xa3, 0x00, 0x00, 0x02};

    PLIB_ETH_MACSetAddress(index,hostAddress);
    </code>

  Remarks:
    On a reset, this register is loaded with the factory preprogrammed
    station address.
*/

void PLIB_ETH_MACSetAddress (ETH_MODULE_ID index, uint8_t *bAddress );


//******************************************************************************
/* Function:
    uint8_t PLIB_ETH_StationAddressGet(ETH_MODULE_ID index, uint8_t which)

  Summary:
    Gets the selected EMAC station address.

  Description:
    This function gets the selected EMAC station address.

  Precondition:
    None.

  Parameters:
    index - Identifier for the device instance
    which - Select station address to change. Valid values are 1,2,3,4,5,6.

  Returns:
    - stationAddress1 - Station address

  Example:
    <code>
    stationAddr1 = PLIB_ETH_StationAddress1Get(MY_ETH_INSTANCE, which);
    </code>

  Remarks:
    On a reset, this register is loaded with the factory preprogrammed
    station address.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/

uint8_t PLIB_ETH_StationAddressGet(ETH_MODULE_ID index, uint8_t which);

//******************************************************************************
/* Function:
    void PLIB_ETH_MACGetAddress (ETH_MODULE_ID index, uint8_t *bAddress )

  Summary:
    Returns the current MAC address.

  Description:
    This function returns the current MAC address.

  Precondition:
    None.

  Parameters:
    index       - Identifier for the device instance.
    bAddress    - Address to store a standard MAC address, 6 bytes, Network order!

  Returns:
    None.

  Example:
     <code>
    uint8_t currentMacAddress;

    PLIB_ETH_MACGetAddress(index,&currentMacAddress);
    </code>

  Remarks:
    On a reset, this register is loaded with the factory preprogrammed
    station address.

    This functionality is not available on all devices. Please refer to the
    specific device data sheet to determine availability.
*/
void PLIB_ETH_MACGetAddress (ETH_MODULE_ID index, uint8_t *bAddress );


// *****************************************************************************
// *****************************************************************************
// Section: ETH Peripheral Library Exists API Routines
// *****************************************************************************
// *****************************************************************************
/* The functions below indicate the existence of the features on the device.
*/

//******************************************************************************
/* Function:
    PLIB_ETH_ExistsPauseTimer( ETH_MODULE_ID index )

  Summary:
    Identifies whether the PauseTimer feature exists on the Ethernet module.

  Description:
    This function identifies whether the PauseTimer feature is available on 
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_PauseTimerSet
    - PLIB_ETH_PauseTimerGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The PauseTimer feature is supported on the device
    - false  - The PauseTimer feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsPauseTimer( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsEnable( ETH_MODULE_ID index )

  Summary:
    Identifies whether the Enable feature exists on the Ethernet module.

  Description:
    This function identifies whether the Enable feature is available on
    the Ethernet module. When this function returns true, these functions are
    supported on the device:
    - PLIB_ETH_Enable
    - PLIB_ETH_Disable
    - PLIB_ETH_IsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The Enable feature is supported on the device
    - false  - The Enable feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsEnable( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsStopInIdle( ETH_MODULE_ID index )

  Summary:
    Identifies whether the StopInIdle feature exists on the Ethernet module.

  Description:
    This function identifies whether the StopInIdle feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_StopInIdleEnable
    - PLIB_ETH_StopInIdleDisable
    - PLIB_ETH_StopInIdleIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The StopInIdle feature is supported on the device
    - false  - The StopInIdle feature is not supported on the device

