venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    None.
*/

bool PLIB_ETH_ExistsTxPacketDescriptorAddress( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsRxPacketDescriptorAddress( ETH_MODULE_ID index )

  Summary:
    Identifies whether the RxPacketDescriptorAddress feature exists on the Ethernet module.

  Description:
    This function identifies whether the RxPacketDescriptorAddress feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_RxPacketDescAddrSet
    - PLIB_ETH_RxPacketDescAddrGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The RxPacketDescriptorAddress feature is supported on the device
    - false  - The RxPacketDescriptorAddress feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsRxPacketDescriptorAddress( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsHashTable( ETH_MODULE_ID index )

  Summary:
    Identifies whether the HashTable feature exists on the Ethernet module.

  Description:
    This function identifies whether the HashTable feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_HashTableSet
    - PLIB_ETH_HashTableGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The HashTable feature is supported on the device
    - false  - The HashTable feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsHashTable( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsPatternMatch( ETH_MODULE_ID index )

  Summary:
    Identifies whether the PatternMatch feature exists on the Ethernet module.

  Description:
    This function identifies whether the PatternMatch feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_PatternMatchSet
    - PLIB_ETH_PatternMatchGet
    - PLIB_ETH_PatternMatchChecksumSet
    - PLIB_ETH_PatternMatchChecksumGet
    - PLIB_ETH_PatternMatchOffsetSet
    - PLIB_ETH_PatternMatchOffsetGet
    - PLIB_ETH_PatternMatchModeSet
    - PLIB_ETH_PatternMatchModeGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The PatternMatch feature is supported on the device
    - false  - The PatternMatch feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsPatternMatch( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsReceiveFilters( ETH_MODULE_ID index )

  Summary:
    Identifies whether the ReceiveFilters feature exists on the Ethernet module.

  Description:
    This function identifies whether the ReceiveFilters feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_ReceiveFilterEnable
    - PLIB_ETH_ReceiveFilterDisable
    - PLIB_ETH_ReceiveFilterIsEnable

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ReceiveFilters feature is supported on the device
    - false  - The ReceiveFilters feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsReceiveFilters( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsReceiveWmarks( ETH_MODULE_ID index )

  Summary:
    Identifies whether the ReceiveWmarks feature exists on the Ethernet module.

  Description:
    This function identifies whether the ReceiveWmarks feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_RxFullWmarkSet
    - PLIB_ETH_RxFullWmarkGet
    - PLIB_ETH_RxEmptyWmarkSet
    - PLIB_ETH_RxEmptyWmarkGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ReceiveWmarks feature is supported on the device
    - false  - The ReceiveWmarks feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsReceiveWmarks( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsInterrupt( ETH_MODULE_ID index )

  Summary:
    Identifies whether the Interrupt feature exists on the Ethernet module.

  Description:
    This function identifies whether the Interrupt feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_InterruptSourceEnable
    - PLIB_ETH_InterruptSourceDisable
    - PLIB_ETH_InterruptSourceIsEnabled
    - PLIB_ETH_InterruptSet
    - PLIB_ETH_InterruptClear
    - PLIB_ETH_InterruptStatusGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The Interrupt feature is supported on the device
    - false  - The Interrupt feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsInterrupt( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsEthernetControllerStatus( ETH_MODULE_ID index )

  Summary:
    Identifies whether the EthernetControllerStatus feature exists on the Ethernet module.

  Description:
    This function identifies whether the EthernetControllerStatus feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_RxPacketCountGet
    - PLIB_ETH_EthernetIsBus
    - PLIB_ETH_TransmitIsBusy
    - PLIB_ETH_ReceiveIsBusy

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The EthernetControllerStatus feature is supported on the device
    - false  - The EthernetControllerStatus feature is not supported on the device

