venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    None.
*/

bool PLIB_ETH_ExistsEthernetControllerStatus( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsReceiveOverflowCount( ETH_MODULE_ID index )

  Summary:
    Identifies whether the ReceiveOverflowCount feature exists on the Ethernet module.

  Description:
    This function identifies whether the ReceiveOverflowCount feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_RxOverflowCountClear
    - PLIB_ETH_RxOverflowCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The ReceiveOverflowCount feature is supported on the device
    - false  - The ReceiveOverflowCount feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsReceiveOverflowCount( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsFramesTransmittedOK( ETH_MODULE_ID index )

  Summary:
    Identifies whether the FramesTransmittedOK feature exists on the Ethernet module.

  Description:
    This function identifies whether the FramesTransmittedOK feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_FramesTxdOkCountClear
    - PLIB_ETH_FramesTxdOkCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The FramesTransmittedOK feature is supported on the device
    - false  - The FramesTransmittedOK feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsFramesTransmittedOK( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsCollisionCounts( ETH_MODULE_ID index )

  Summary:
    Identifies whether the CollisionCounts feature exists on the Ethernet module.

  Description:
    This function identifies whether the CollisionCounts feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_SingleCollisionCountClear
    - PLIB_ETH_SingleCollisionCountGet
    - PLIB_ETH_MultipleCollisionCountClear
    - PLIB_ETH_MultipleCollisionCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The CollisionCounts feature is supported on the device
    - false  - The CollisionCounts feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsCollisionCounts( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsFramexReceivedOK( ETH_MODULE_ID index )

  Summary:
    Identifies whether the FramexReceivedOK feature exists on the Ethernet module.

  Description:
    This function identifies whether the FramexReceivedOK feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_FramesRxdOkCountClear
    - PLIB_ETH_FramesRxdOkCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The FramexReceivedOK feature is supported on the device
    - false  - The FramexReceivedOK feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsFramexReceivedOK( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsFCSErrorCount( ETH_MODULE_ID index )

  Summary:
    Identifies whether the FCSErrorCount feature exists on the Ethernet module.

  Description:
    This function identifies whether the FCSErrorCount feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_FCSErrorCountClear
    - PLIB_ETH_FCSErrorCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The FCSErrorCount feature is supported on the device
    - false  - The FCSErrorCount feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsFCSErrorCount( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsAlignmentErrorCount( ETH_MODULE_ID index )

  Summary:
    Identifies whether the AlignmentErrorCount feature exists on the Ethernet module.

  Description:
    This function identifies whether the AlignmentErrorCount feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_AlignErrorCountClear
    - PLIB_ETH_AlignErrorCountGet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The AlignmentErrorCount feature is supported on the device
    - false  - The AlignmentErrorCount feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsAlignmentErrorCount( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMAC_Resets( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MAC_Resets feature exists on the Ethernet module.

  Description:
    This function identifies whether the MAC_Resets feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_MIIResetEnable
    - PLIB_ETH_MIIResetDisable
    - PLIB_ETH_MIIResetIsEnabled
    - PLIB_ETH_SimResetEnable
    - PLIB_ETH_SimResetDisable
    - PLIB_ETH_SimResetIsEnabled
    - PLIB_ETH_MCSRxResetEnable
    - PLIB_ETH_MCSRxResetDisable
    - PLIB_ETH_MCSRxResetIsEnabled
    - PLIB_ETH_RxFuncResetEnable
    - PLIB_ETH_RxFuncResetDisable
    - PLIB_ETH_RxFuncResetIsEnabled
    - PLIB_ETH_MCSTxResetEnable
    - PLIB_ETH_MCSTxResetDisable
    - PLIB_ETH_MCSTxResetIsEnabled
    - PLIB_ETH_TxFuncResetEnable
    - PLIB_ETH_TxFuncResetDisable
    - PLIB_ETH_TxFuncResetIsEnabled

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MAC_Resets feature is supported on the device
    - false  - The MAC_Resets feature is not supported on the device

