venkatarajasekhar/mplab-harmony/apps/usb/device/cdc_com_port_dual/firmware/src/system_config/pic32mx470_curiosity/framework/peripheral/eth/plib_eth.h
  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMIIWriteReadData( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsMIIM_Indicators( ETH_MODULE_ID index )

  Summary:
    Identifies whether the MIIM_Indicators feature exists on the Ethernet module.

  Description:
    This function identifies whether the MIIM_Indicators feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_LinkHasFailed
    - PLIB_ETH_DataNotValid
    - PLIB_ETH_MIIMIsScanning
    - PLIB_ETH_MIIMIsBusy

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The MIIM_Indicators feature is supported on the device
    - false  - The MIIM_Indicators feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsMIIM_Indicators( ETH_MODULE_ID index );


//******************************************************************************
/* Function:
    PLIB_ETH_ExistsStationAddress( ETH_MODULE_ID index )

  Summary:
    Identifies whether the StationAddress feature exists on the Ethernet module.

  Description:
    This function identifies whether the StationAddress feature is available on
    the Ethernet module. When this function returns true, these functions are 
    supported on the device:
    - PLIB_ETH_StationAddressGet
    - PLIB_ETH_StationAddressSet

  Preconditions:
    None.

  Parameters:
    index           - Identifier for the device instance

  Returns:
    - true   - The StationAddress feature is supported on the device
    - false  - The StationAddress feature is not supported on the device

  Remarks:
    None.
*/

bool PLIB_ETH_ExistsStationAddress( ETH_MODULE_ID index );

//******************************************************************************
/* Function:
    PLIB_ETH_ExistsRxFiltersPMSet( ETH_MODULE_ID index )

  Summary:
    Identifies whether the Pattern Match Rx Filter feature 
	exists on the Ethernet module.

  Description:
    This function identifies whether the Pattern Match Rx Filter feature is 
	available on the Ethernet module. When this function returns true, 
	these functions are supported on the device:
    -  PLIB_ETH_RxFiltersPMSet

  Preconditions:
    None.

  Parameters:
    index   - Identifier for the device instance

  Returns:
    - true   - The feature is supported on the device
    - false  - The feature is not supported on the device

  Remarks:
    None.
*/
bool PLIB_ETH_ExistsRxFiltersPMSet( ETH_MODULE_ID index );

//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatRxOvflCnt ( ETH_MODULE_ID index )

  Summary:
    Returns the current number of dropped receive frames.

  Description:
    This function returns the current number of dropped receive frames by the
    Ethernet controller.  These are frames accepted by the RX filter but dropped due
    to internal receive error (RX FIFO overrun).

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of dropped receive frames

  Example:
    <code>
    droppedFrames = PLIB_ETH_StatRxOvflCnt(index);
    </code>

  Remarks:
    This statistics register is cleared by the read operation.

    An RX overflow event is signalled by the ETH_EV_RXOVFLOW event (see
    PLIB_ETH_EVENTS definition).
 */

int PLIB_ETH_StatRxOvflCnt ( ETH_MODULE_ID index );

// DOM-IGNORE-BEGIN
#define PLIB_ETH_StatRxOvflCnt  PLIB_ETH_RxOverflowCountGet
// DOM-IGNORE-END


//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatRxOkCnt ( ETH_MODULE_ID index )

  Summary:
    Returns the current number of successfully received frames.

  Description:
    This function returns the current number of successfully received frames by
    the Ethernet controller.  These are frames accepted by the RX filter (some of
    them may still be dropped because of an RX FIFO overrun).

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of frames received OK

  Example:
    <code>
    numReceived = PLIB_ETH_StatRxOkCnt(index);
    </code>

  Remarks:
    This statistics register is cleared by the read operation.

    Frames with FCS or alignment errors will not increment this count.

 */

int PLIB_ETH_StatRxOkCnt ( ETH_MODULE_ID index );

// DOM-IGNORE-BEGIN
#define  PLIB_ETH_StatRxOkCnt  PLIB_ETH_FramesRxdOkCountGet
// DOM-IGNORE-END


//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatRxFcsErrCnt ( ETH_MODULE_ID index )

  Summary:
    Returns the current number of frames with FCS received errors.

  Description:
    The function returns the current number of frames with FCS errors received
    by the Ethernet controller.  These are received frames that have an integral
    number of bytes.

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of received frames having FCS errors

  Example:
    <code>
    numRxFcsErrors = PLIB_ETH_StatRxFcsErrCnt(index);
    </code>

  Remarks:
    This statistics register is cleared by the read operation.

    Frames with alignment error do not increment this count.

 */

int PLIB_ETH_StatRxFcsErrCnt ( ETH_MODULE_ID index );

// DOM-IGNORE-BEGIN
  #define  PLIB_ETH_StatRxFcsErrCnt  PLIB_ETH_FCSErrorCountGet
// DOM-IGNORE-END


//*******************************************************************************
/*  Function:
    int PLIB_ETH_StatRxAlgnErrCnt ( ETH_MODULE_ID index )

  Summary:
    Returns the current number of frames with alignment received errors

  Description:
    The function returns the current number of frames with alignment errors
    received by the Ethernet controller.  These are received frames that have FCS
    error and they do not contain an integral number of bytes (aka
    dribble-nibble).

  Precondition:
    None.

  Parameters:
    index  - Identifier for the device instance.

  Returns:
    The number of received frames having alignment errors

  Example:
    <code>
    numAlignErrors = PLIB_ETH_StatRxAlgnErrCnt(index);
    </code>

